Repository: mdkusz/AIChessDB
Catalog: AIChessDatabase/Properties/UIElements.*.resx
Languages: es

# cbBoard_Description
source: Controls to edit board piece dsipositions with regular expressions, square configurations, and partial boards
es: Controles para editar configuraciones de tablero complejas, con expresiones regulares, configuración de escaques, y tableros parciales

# cbOperators_Name
source: Filter Operators
es: Operadores de filtro

# cbOperators_Description
source: Dropdow list with logic operators to apply to the seleced squares in a filter condition
es: Lista desplegable de operadores lógicos para aplicar a los escaques seleccionados en una condición de filtro

# bAddCom_Name
source: Add Comment Button
es: Botón añadir comentario

# bAddCom_Description
source: Add a new comment to the comment list
es: Añadir un nuevo comentario a la lista

# bCancelChg_Name
source: Cancel Changes Button
es: Botón cancelar cambios

# bCancelChg_Description
source: Cancel all non-commited changes and reset to the old values
es: Cancelar todos los cambios no aceptados y recuperar los valores anteriores

# bUpdate_Name
source: Update Changes Button
es: Botón actualizar cambios

# bUpdate_Description
source: Accept all changes and store them in the database
es: Aceptar todos los cambios y guardarlos en la base de datos

# bDeleteCom_Name
source: Delete Comment Button
es: Botón eliminar comentario

# bDeleteCom_Description
source: Remove the selected comment from the list
es: Eliminar el comentario seleccionado de la lista

# bChangeCom_Name
source: Change Comment Button
es: Botón cambiar comentario

# bChangeCom_Description
source: Change the selected comment text for that in the comment editor
es: Cambiar el texto del comentario seleccionado por el del editor de comentarios

# txtComment_Name
source: Comments Editor
es: Editor de comentarios

# txtComment_Description
source: Type the comment text for new comments or to modify existing ones
es: Escribe el texto para los nuevos comentarios o para modificar los existentes

# lbComments_Name
source: Comments List
es: Lista de comentarios

# lbComments_Description
source: List with match or move comments
es: Lista de comentarios de partida o de movimientos

# bMatchNewKey_Description
source: Add a new keyword to the match
es: Añadir una nueva etiqueta a la partida

# bDelete_Name
source: Delete Keyword Button
es: Botón eliminar etiqueta

# bDelete_Description
source: Remove the current selected keyword from this match
es: Eliminar la etiqueta seleccionada de esta partida

# bChangeValue_Name
source: Change Keyord Value Button
es: Botón cambiar valor de etiqueta

# bChangeValue_Description
source: Change the value of the selected keyword for this match
es: Cambiar el valor de la etiqueta seleccionada para esta partida

# txtKeyValue_Name
source: Keyword Value
es: Valor de la etiqueta

# txtKeyValue_Description
source: Type a value for the selected keyword for this match
es: Escribe un valor para la etiqueta seleccionada para esta partida

# PGNdgMatches_Description
source: List of matches contained in the PGN file
es: Listado de partidas contenidas en el archivo PGN

# PGN_toolStrip1_Name
source: Match Grid Toolbar
es: Barra de herramientas del listado de partidas

# PGN_toolStrip1_Description
source: Toolbar with command buttons to manage matches contained imported from PGN files
es: Barra de herramientas con botones para gestionar partidas importadas desde archivos PGN

# bView_Name
source: View Match Button
es: Botón ver partida

# bView_Description
source: Display the selected match on the board and play through its moves to explore positions.
es: Mostrar la partida en el tablero, donde puedes recorrer sus movimientos y ver las distintas posiciones.

# bCheck_Name
source: Check Selected Button
es: Botón marcar seleccionadas

# bCheck_Description
source: Set check mark for all the selected rows in the grid. Some commands operate on checked matches only.
es: Marcar las filas seleccionadas en el listado. Algunos comandos solo actúan sobre las partidas marcadas,

# bSelAll_Name
source: Check All Button
es: Botón marcar todas

# bSelAll_Description
source: Check all the matches in the grid
es: Marcar todas las partidas del listado

# bUncheck_Name
source: Uncheck Button
es: Botón desmarcar

# bUncheck_Description
source: Uncheck all the selected rows in the grid
es: Quitar la marca de todas las filas seleccionadas en el listado

# bInsert_Name
source: Insert Matches Button
es: Botón insertar partidas

# bInsert_Description
source: Insert all the checked matches in the database
es: Insertar todas las partidas seleccionadas en la base de datos

# pgInsert_Name
source: Progress Bar
es: Barra de progreso

# pgInsert_Description
source: Current operation progress bar
es: Barra de progreso de la operación en curso

# QueryWindow_toolStrip1_Name
source: Query Form ToolBar
es: Barra de herramientas del formulario de consultas

# QueryWindow_toolStrip1_Description
source: Command bar for handling the list of games matching the current query.
es: Barra de herramientas con comandos para gestionar la lista de partidas obtenidas con la consulta actual

# bFilterByTag_Name
source: Filter by Tag Button
es: Botón filtrar por etiquetas

# bFilterByTag_Description
source: Select a query to find matches using tags or statistical values.
es: Seleccionar una consulta para buscar partidas usando los valores de sus etiquetas o estadísticas.

# bFilterByPos_Name
source: Filter by Position Button
es: Botón filtrar por posiciones

# bFilterByPos_Description
source: Select a query to find matches using board piece positions.
es: Seleccionar una consulta para buscar partidas usando posiciones de piezas en el tablero.

# bFilterByMov_Name
source: Filter by Move Button
es: Botón filtrar por movimientos

# bFilterByMov_Description
source: Select a query to find matches using piece movements.
es: Seleccionar una consulta para buscar partidas usando los movimientos de las piezas en el tablero.

# QueryWindow_bDelete_Name
source: Delete Results Button
es: Botón eliminar resultados

# QueryWindow_bDelete_Description
source: Remove the selected matches from the grid (does not remove them from the database)
es: Eliminar las partidas seleccionadas del listado (no se eliminarán de la base de datos)

# bTagSel_Name
source: Label Matches Button
es: Botón etiquetar partidas

# bTagSel_Description
source: Add keyword values to all the selected matches
es: Añadir etiquetas de partida a todas las partidas seleccionadas.

# bEditMatch_Name
source: Edit Match Button
es: Botón editar partida

# bEditMatch_Description
source: Edit the selected match
es: Editar la partida seleccionada

# bPlay_Name
source: Play Match Button
es: Botón jugar partida

# bPlay_Description
source: Open the play window to replay the selected game and find games with shared positions.
es: Abrir la ventana de ejecución de partida y búsqueda de partidas con posiciones compartidas.

# bDelMatch_Name
source: Delete Matches Button
es: Botón eliminar partdas

# bDelMatch_Description
source: Remove the selected matches form the database
es: Eliminar las partidas seleccionadas de la base de datos

# bExportPGN_Name
source: Export to PGN Button
es: Botón exportar a PGN

# bExportPGN_Description
source: Export the seleced matches to a file in PGN format
es: Exportar las partidas seleccionadas a un archivo en formato PGN

# cbDatabases_Name
source: Target Database
es: Base de datos destino

# cbDatabases_Description
source: Select a target database to export selected macthes to
es: Seleccionar la base de datos destino para exportar las partidas

# pbExport_Name
source: Export Progress Bar
es: Barra de progreso de exportación

# pbExport_Description
source: Progress bar that shows the match exportation progress to another database or a PGN file
es: Barra de progreso para la exportación de partidas a otra base de datos o a un archivo

# mDisplay_Name
source: Match Move Display
es: Panel de movimientos de partida

# mDisplay_Description
source: Pane to show the movements of the currently selected match
es: Panel que muestra los movimientos de la partida seleccionada actualmente

# cbNever_Name
source: Never Occurs
es: Nunca ocurre

# cbNever_Description
source: Include only games/matches where the selected event(s) never occur.
es: Incluir solo partidas donde el/los evento(s) seleccionados no aparecen en ningún momento.

# cfPlay_ToolStrip_Name
source: Play Editor Tool Bar
es: Barra de herramientas del editor de Plays

# cfPlay_ToolStrip_Description
source: Toolbar with command buttons and other controls to create and modify plays
es: Barra de herramientas con botones de comando y otros controles para gestionar el editor de plays

# bFont_Name
source: Change Font Button
es: Botón cambiar fuente

# bFont_Description
source: Select and configure a new Font to apply to all controls in this form
es: Seleccione y configure un nuevo tipo de letra para aplicar a todos los controles de este formulario

# cbPlays_Name
source: Play List ComboBox
es: Lista desplegable de equipos

# cbPlays_Description
source: Select the play you want to edit from this list. New plays will be added here
es: Selecciona el equipo que quieres editar en esta lista. Los nuevos equipos también se añadirán aquí

# bPlayFromList_Name
source: Edit Selected Play Button
es: Botón editar play seleccionada

# bPlayFromList_Description
source: Once selected a play in the list, press this buttón to load and edit it
es: Una vez seleccionada una play en la lista, pulsa este botón para cargarla y editarla

# bRemovePlay_Name
source: Remove Play Button
es: Botón eliminar play

# bRemovePlay_Description
source: Remove the selected play from the list of plays
es: Eliminar la play seleccionada de la lista de plays

# bSaveConfiguration_Name
source: Save Play List Button
es: Botón guardar lista de plays

# bSaveConfiguration_Description
source: Save the play list to the play configuration file
es: Guardar la lista de plays en el archivo de configuración

# cbAddItem_Name
source: Available Item List
es: Lista de items disponibles

# cbAddItem_Description
source: List of available items to add to the selected node in the play tree control
es: Lista de items disponibles para añadir al nodo seleccionado en el control de árbol de la play

# tsbAddItem_Name
source: Add Item Button
es: Botón añadir item

# tsbAddItem_Description
source: Add the selected item to the selected node in the play tree control
es: Añadir el item seleccionado al nodo seleccionado en el control de árbol del equipo

# tsbRemoveItem_Name
source: Remove Item Button
es: Botón eliminar item

# tsbRemoveItem_Description
source: Remove the currently selected item in the play tree control
es: Eliminar el item seleccionado actualmente en el control de árbol del equipo

# rtvPlay_Name
source: Play Tree View
es: Vista de árbol del equipo

# rtvPlay_Description
source: Tree view showing the play structure being edited
es: Vista de árbol con la estructura del equipo que se está editando

# flpPlay_Name
source: Property Editors Pane
es: Panel de editores de propiedades

# flpPlay_Description
source: When you select an editable node in the play tree, the editing controls will be show here
es: Cuando seleccionas un nodo editable en la vista de árbol del equipo, los controles de edición se muestran aquí.

# AEditor_Toolbar_Name
source: Assistants Editor ToolBar
es: Barra de herramientas del editor de asistentes

# AEditor_Toolbar_Description
source: Toolbar with command buttons and controls to edit assistants and tools
es: Barra de herramientas con botones de comando y controles para editar asistentes y sus herramientas

# rtvStructure_Name
source: Item Structure Tree
es: Árbol de estructura del elemento

# rtvStructure_Description
source: Tree view with the data structure of the selected element instance
es: Vista de árbol con la estructura de datos de la instancia del elemento seleccionado.

# flpEditor_Name
source: Property Editors Pane
es: Panel de editores de propiedades

# flpEditor_Description
source: When you select an editable node in the structure tree, the editing controls will be show here
es: Cuando seleccionas un nodo editable en la vista de árbol de la estructura, los controles de edición se muestran aquí.

# cbAPIManager_Name
source: API Manager List
es: Lista de gestores de APIs

# cbAPIManager_Description
source: Dropdown list with all the API managers available in this application
es: Lista desplegable con todos los gestores de APIs disponibles en la aplicación

# cbItemType_Name
source: Available Item Type List
es: Lista de tipos de elemento disponibles

# cbItemType_Description
source: Select an item type from the list to create instances of it
es: Selecciona un tipo de elemento de la lista para crear instancias de ese tipo

# bNewItem_Name
source: Create New Instance Button
es: Botón crear nueva instancia

# bNewItem_Description
source: Press this button to create a new instance of the selected item type
es: Pulsa este botón para crear una nueva instancia del tipo de objeto seleccionado

# cbInstance_Name
source: Item Instance List
es: Lista de instancias de elementos

# cbInstance_Description
source: Dropdown list with all the item instances of the selected type in the configuration file
es: Lista desplegable con todas las instancias de los elementos del tipo seleccionado en el archivo de configuración

# bDelItem_Name
source: Delete Instance Button
es: Botón eliminar instancia

# bDelItem_Description
source: Remove the selected item instance
es: Eliminar la instancia de elemento seleccionada

# bSaveItem_Name
source: Save Changes Button
es: Botón guardar cambios

# bSaveItem_Description
source: Save all changes to the provider cloud and configuration files
es: Guardar todos los cambios en la nube del proveedor y los archivos de configuración

# cbOtherInstance_Name
source: Non-Registered Instance List
es: Lista de instancias no registradas

# cbOtherInstance_Description
source: Dropdown list with all the item instances of the selected type not in the configuration file
es: Lista desplegable con todas las instancias de los elementos del tipo seleccionado que no están en el archivo de configuración

# AUpdates_Toolbar_Description
source: Toolbar with command buttons and controls to edit assistant updates
es: Barra de herramientas con botones de comando y controles para editar las actualizaciones de los asistentes

# AUpdates_Toolbar_Name
source: Updates Editor ToolBar
es: Barra de herramientas del editor de actualizaciones

# bEditDoc_Name
source: Edit Document Button
es: Botón editar documento

# bEditDoc_Description
source: Open a suitable editor for editing the selected file
es: Abre un editor apropiado para editar el archivo seleccionado

# bAddDoc_Name
source: Add Documents Button
es: Botón añadir documentos

# bAddDoc_Description
source: Select documents to add to the selected document list
es: Seleccionar documentos para añadir a la lista seleccionada

# bApplyUpdates_Name
source: Apply Updates Button
es: Botón aplicar actualizaciones

# bApplyUpdates_Description
source: Apply all selected updates (documents and assistant instructions)
es: Aplicar todas las actualizaciones seleccionadas (documentos e instrucciones de los asistentes)

# pgUpdates_Name
source: Updates Progress Bar
es: Barra de progreso de actualizaciones

# pgUpdates_Description
source: This progress bar shows the file updates progress
es: Esta barra de progreso muestra el avance de las operaciones de actualización de archivos

# bAddPlay_Name
source: Add New Play Button
es: Botón añadir nuevo equipo

# bAddPlay_Description
source: Add a new play to the play collection
es: Añadir un nuevo equipo a la colección de equipos

# bDefaultPlay_Name
source: Default Play Button
es: Botón equipo por defecto

# bDefaultPlay_Description
source: Set this play as the default play when application starts
es: Establecer este equipo como el equipo por defecto al iniciar la aplicación

# bConsole_Name
source: Set Current Play Button
es: Botón establecer equipo activo

# bConsole_Description
source: Set this play as the current console play. Note: current conversation context will be lost.
es: Establecer este equipo como el equipo activo en la consola. Nota: el contexto actual de la conversación se perderá.

# lMatchCount_Name
source: Match Total Count
es: Cuenta total de partidas

# lMatchCount_Description
source: {0} Matches in this database
es: {0} Partidas en esta base de datos

# bAddComments_Description
source: Comments sent by assistants will be added to the current move
es: Los comentarios enviados por los asistentes se añadirán al movimiento actual

# bAddComments_Name
source: Add Assistant Comments Button
es: Botón añadir comentarios de asistente

# cbAllTogether_Name
source: All Events at Once
es: Todos los eventos a la vez

# cbAllTogether_Description
source: Check to find moves where all the selected events occur at once. There is no complete check of event incompatibility.
es: Marcar para encontrar movimientos en los que todos los eventos seleccionados se dan a la vez. No se comprueba completamente la incompatibilidad de eventos.

# DetailFiltersHeader
source: Detail Filters
es: Filtros detalle
