Repository: mdkusz/AIChessDB
Catalog: AIChessDatabase/Properties/UIElements.*.resx
Languages: es

# txtBlack_Description
source: TextBox to enter the name of the black player
es: TextBox para escribir el nombre del jugador que juega con las negras

# txtBlack_Name
source: Black Player
es: Jugador Negras

# txtWhite_Name
source: White Player
es: Jugador Blancas

# txtDate_Description
source: TextBox to write a date for the match. Format is free, as it is stored as text in the database.
es: TextBox para introducir la fecha de la partida. El formato es libre, ya que se almacena como texto en la base de datos.

# txtDate_Name
source: Date
es: Fecha

# txtWhite_Description
source: TextBox to enter the name of the white player
es: TextBox para escribir el nombre del jugador que juega con las blancas

# txtMatch_Name
source: Match Description
es: Descripción de la partida

# txtMatch_Description
source: TextBox to enter a text with a description of the match
es: TetxBox para introducir un texto con una descripción de la partida

# bCancel_Name
source: Cancel Button
es: Botón cancelar

# bCancel_Description
source: Button to close the dialog box and cancel the operation
es: Botón para cerrar el cuadro de diálogo y cancelar la operación

# bOK_Name
source: OK Button
es: Botón aceptar

# bOK_Description
source: Button to accept all data entered and continue with the operation
es: Botón para aceptar los datos introducidos y continuar con la operación.

# cbResult_Name
source: Match Result
es: Resultado de la partida

# cbResult_Description
source: ComboBox to select the match result in text format
es: ComboBox para seleccionar el resultado de la partida en formato de texto

# DlgNewMatch_Name
source: New Match Info
es: Información de partida

# DlgNewMatch_Description
source: Dialog Box to provide basic information to create a new match
es: Cuadro de diálogo para introducir información básica para la nueva partida

# cbDestinationDB_Name
source: Destination Database
es: Base de datos destino

# cbDestinationDB_Description
source: Select a database provider to copy matches to
es: Selecciona un proveedor de base de datos de destino para copiar las partidas

# txtSize_Name
source: Block Size
es: Tamaño de bloque

# txtSize_Description
source: Number of matches to copy as a block, before commiting work
es: Número de partidas a copiar como un bloque, antes de validar los cambios

# cbDuplicates_Name
source: Allow Duplicates
es: Permitir duplicados

# cbDuplicates_Description
source: Allow copy matches considered duplicated in the destination database
es: Permitir copiar partidas que se consideran duplicadas en la base de datos de destino

# pbCopy_Name
source: Copy Progress
es: Progreso de la copia

# pbCopy_Description
source: Copy progress indicator bar
es: Barra indicadora del progreso de la copia

# bExport_Name
source: Export Button
es: Botón exportar

# bExport_Description
source: Start copying matches to the destination database
es: Empezar a copiar partidas a la base de datos de destino

# cbDelete_Name
source: Delete Files
es: Eliminar archivos

# cbDelete_Description
source: Check to delete PGN files when done
es: Marcar para eliminar los archivos PGN al terminar

# pbFiles_Name
source: Files Progress
es: Progreso de archivos

# pbFiles_Description
source: Progress bar for the number of processed files
es: Barra de progreso para el número de archivos procesados

# bFiles_Name
source: Select Files Button
es: Botón seleccionar archivos

# bFiles_Description
source: Press this button to open a multi-select file dialog box to select the source PGN files
es: Pulsa este botón para abrir un cuadro de diálogo con selección múltiple para seleccionar los archivos PGN de origen

# bImport_Name
source: Import Button
es: Botón importar

# bImport_Description
source: Press this button to start importing matches
es: Pulsa este botón para comenzar a importar las partidas

# pbMatches_Name
source: Mathces Progress Bar
es: Barra de progreso de partidas

# pbMatches_Description
source: Progress bar for the number of matches imported from the current file
es: Barra de progreso para el número de partidas importadas desde el archivo actual

# cbKeyword_Name
source: Keywords
es: Etiquetas

# cbKeyword_Description
source: Combo box to select a match keyword to consolidate values
es: Lista desplegable de etiquetas. Selecciona una para consolidar sus valores.

# lbValues_Name
source: Value List
es: LIsta de valores

# lbValues_Description
source: List with all the different values of the selected keyword
es: Lista con todos los valores diferentes para la etiqueta seleccionada

# txtFilter_Name
source: Value Filter
es: Filtro de valores

# txtFilter_Description
source: Text to filter the values in the value list. You can use regular expressions
es: Texto para filtrar los valores de la lista. Es posible usar expresiones regulares

# bFilter_Name
source: Apply Filter Button
es: Botón aplicar filtro

# bFilter_Description
source: Press this button to apply current filter to value list
es: Pulsa este botón para aplicar el filtro actual a la lista de valores

# bFilterEq_Description
source: Press this button to apply current filter to value equivalences list
es: Pulsa este botón para aplicar el filtro actual a la lista de equivalencias de valores

# txtFilterEq_Name
source: Equivalence Filter
es: Filtro de equivalencias

# txtFilterEq_Description
source: Text to filter the values in the value equivalences list. You can use regular expressions
es: Texto para filtrar las equivalencias de valores de la lista. Es posible usar expresiones regulares

# lbEquivalences_Name
source: Equivalences List
es: Lista de equivalencias

# lbEquivalences_Description
source: List of possible equivalent values; choose the ones that truly match the selected item.
es: Lista de posibles valores equivalentes aL seleccionado; selecciona aquellos que lo son realmente

# bConsolidate_Name
source: Consolidate Button
es: Botón consolidar

# bConsolidate_Description
source: Convert all selected equivalent values to the canonical value
es: Convertir todos los valores equivalentes seleccionados al valor canónico

# bClose_Name
source: Coles Button
es: Botón cerrar

# bClose_Description
source: Close the dialog box
es: Cerrar el cuadro de diálogo

# txtCanonical_Name
source: Canonical text
es: Texto canónico

# txtCanonical_Description
source: The selected equivalent values will be replaced with this canonical text.
es: Texto con el que se reemplazarán todos los valores equivalentes seleccionados

# bRefresh_Name
source: Refresh Button
es: Botón refrescar

# bRefresh_Description
source: Refresh the list of values
es: Refrescar la lista de valores

# bRefreshEq_Description
source: Refresh the equivalnt values list
es: Refrescar la lista de valores equivalentes

# txtNewKey_Name
source: New Keyword
es: Nueva etiqueta

# txtNewKey_Description
source: Write the name of an existing key or a new one
es: Escribe el nombre de una nueva etiqueta, o el de una etiqueta existente

# bNewKey_Name
source: Add Keyword Button
es: Botón añadir etiqueta

# bNewKey_Description
source: Add a new keyword to the keyword combo box
es: Añadir una nueva etiqueta a la lista desplegable

# cbKeywords_Name
source: Available Keywords
es: Etiquetas disponibles

# cbKeywords_Description
source: Available keywords combo box. You can add new keywords to this litst.
es: Lista desplegable de etiquetas disponibles. Es posible añadir nuevos nombres de etiqueta.

# cPlayer_Name
source: Match Viewer
es: Visor de partida

# cPlayer_Description
source: Chess board. Users can step forward and backward through the moves on the board and view the corresponding positions and comments.
es: Tablero de ajedrez. Los usuarios pueden navegar hacia delante y atrás por los movimientos, viendo las posiciones y los comentarios añadidos a la partida.

# mmDisplay_Name
source: Match Movements List
es: Lista de movimientos

# mmDisplay_Description
source: Move list. Click any ply to view the corresponding board position.
es: Lista de movimientos. Pulsa en cualquier jugada para ver la posición del tablero correspondiente.

# txtComments_Name
source: Comments
es: Comentarios

# txtComments_Description
source: Multiline comment box for the current ply.
es: Cuadro de texto de comentarios sobre el movimiento actual

# lvKeys_Name
source: Keyword List
es: Lista de etiquetas

# lvKeys_Description
source: List of keyword tags grouped by category (e.g., move info, statistics, and annotations).
es: Lista de etiquetas agrupadas por categoría. (información de partida, estadísticas de movimiento, etc.)

# board_Name
source: Chess Board
es: Tablero

# board_Description
source: Chessboard displaying the game positions.
es: Tablero que muestra las posiciones de las piezas

# ChessPlayer_bCancel_Description
source: Cancel comments changes
es: Cancelar cambios en los comentarios

# ChessPlayer_bOK_Description
source: Accept current comment changes
es: Aceptar los cambios en los comentarios

# ChessPlayer_bNew_Name
source: New Comment
es: Nuevo comentario

# ChessPlayer_bNew_Description
source: Add a new comment to the current ply comment list
es: Añadir un nuevo comentario a la lista de comentarios del movimiento.

# Board_toolStrip1_Name
source: Board Tool Bar
es: Barra de herramientas del tablero

# Board_toolStrip1_Description
source: Tool bar with command buttons to interact with the chess board
es: Barra de herramientas con botones de comando para interactuar con el tablero

# bReset_Name
source: Reset Match
es: Reiniciar parida

# bReset_Description
source: Press this button to move back to the match initial position
es: Pulsa este botón para volver a la posición inicial de la partida

# bBack_Name
source: Back Button
es: Botón retroceder

# bBack_Description
source: Press this button to move back a match ply
es: Botón para retroceder un movimiento en la partida

# bNext_Name
source: Next Button
es: Botón avanzar

# bNext_Description
source: Press this button to go to next play
es: Botón para avanzar un movimiento en la partida

# txtMove_Name
source: Ply Text
es: Texto del movimiento

# txtMove_Description
source: Algebraic notation (AN) text of the current match move
es: Jugada actual en notación algebraica (AN)

# bRotateView_Name
source: Rotate View Button
es: Botón rotar vista

# bRotateView_Description
source: Switch the perspective: display Black on top or White on top.
es: Cambiar la perspectiva del tablero: :negras arriba, o blancas arriba

# bInitialPos_Name
source: Initial Position Button
es: Botón posición inicial

# bInitialPos_Description
source: When this control is in edit mode, use this button to opena dialog box to set the match initial position
es: Cuando el control está en modo edición, este botón muestra un cuadro de diálogo para componer la posición iniicial

# bMarkMoves_Name
source: Mark Moves Button
es: Botón marcar movimientos

# bMarkMoves_Description
source: Toggle highlighting of the from and to squares when playing.
es: Activar o desactivar marcado de los escaques inicial y final de los movimientos.

# pbBoard_Name
source: Board Image
es: Imagen del tablero

# pbBoard_Description
source: This is a picture of the current board position
es: Imagen de la posición actual en el tablero

# MatchMoveDisplay_toolStrip1_Name
source: Moves Tool Bar
es: Barra de herramientas de movimientos

# MatchMoveDisplay_toolStrip1_Description
source: Toolbar with command buttons to interact with the match move display
es: Barra de herramientas con botones de comando para interactuar con el panel de movimientos

# bTopDown_Name
source: Top / Down Button
es: Botón arriba /abajo

# bTopDown_Description
source: Display moves in columns, filling each column top to bottom before continuing to the next.
es: Muestra los movimientos en columnas, llenándolas de arriba a abajo y de izquierda a derecha

# bLeftRight_Name
source: Left / Right Button
es: Botón izquerda / derecha

# bLeftRight_Description
source: Display moves in rows, filling each row left to right before continuing to the next.
es: Muestra los movimientos en filas, llenándolas de izquierda a derecha y de arriba a abajo

# txtAddMove_Name
source: Add Move Text
es: Editor nuevo movimiento

# txtAddMove_Description
source: When in edit mode, write the new ply here using standard algebraic notation.
es: En modo edición, escribe aquí el siguiente movimiento en notación algebraica estándar

# bAddMove_Name
source: Add Move Button
es: Botón añadir movimiento

# bAddMove_Description
source: Press this button to add a new ply to the end of the match moves
es: Pulsa este botón para añadir un nuevo movimiento al final de la partida

# bDelMove_Name
source: Delete Move Button
es: Botón eliminar movimiento

# bDelMove_Description
source: Remove the last ply in the match
es: Eliminar el último movimiento de la partida

# pbMatch_Name
source: Move List
es: Lista de movimientos

# pbMatch_Description
source: Match movements list
es: Lista de movimientos de la partida

# PositionViewer_toolStrip1_Name
source: Position Viewer Tool Bar
es: Barra de herramientas del visor de partidas

# PositionViewer_toolStrip1_Description
source: Command bar for handling the list of games matching the current position.
es: Barra de herramientas con comandos para gestionar la lista de partidas que comparten la posición actual

# bFind_Name
source: Find Button
es: Botón buscar

# bFind_Description
source: Find all games containing the current position and show the first N plies from it.
es: Busca partidas que contienen la posición actual y muestra los primeros N movimientos desde esa posición.

# txtMoves_Name
source: Moves from Position
es: Movimientos desde posición

# txtMoves_Description
source: Write the number of plies from the current position to show in filtered matches
es: Escribe el número de movimientos a mostrar desde la posición actual en las partidas encontradas

# bShow_Name
source: Show Match Button
es: Botón mostrar partida

# bShow_Description
source: Button to show the current selected match
es: Botón para mostrar la partida seleccionada

# pBoards_Name
source: Boards Pane
es: Panel de tableros

# pBoards_Description
source: Tiny board list with the matching positions of the selected match
es: Lista de tableros miniatura con las posiciones de la partida seleccionada

# dgMatches_Name
source: Matches Grid
es: Listado de partidas

# dgMatches_Description
source: Grid with matches that satisfy the filter criteria
es: Listado de partidas que cumplen con los criterios actuales del filtro

# ColumnManagerUI_lvColumns_Name
source: Additional Columns List
es: Lista de columnas adicionales

# ColumnManagerUI_lvColumns_Description
source: You can use any of those coluns to build additional filters to refine query results
es: Puedes usar cualquiera de estas columnas para filtrar la consulta y obtener resultados más precisos

# ColumnManagerUI_ctxMenu_Name
source: Contextual Menu
es: Menú contextual

# ColumnManagerUI_ctxMenu_Description
source: Menú with options to use columns in the list
es: Menú con opciones para utilizar las columnas de la lista

# cbDraw_Name
source: Draw Offer
es: Oferta de tablas

# cbDraw_Description
source: Select matches with one or more draw offers
es: Seleccionar partidas con una o más ofertas de tablas

# cbCastling_Name
source: Castling Type
es: Tipo de enroque

# cbCastling_Description
source: Select matches with this type of castling
es: Seleccionar partidas con este tipo de enroque

# cbCheck_Name
source: Check Type
es: Tipo de jaque

# cbCheck_Description
source: Select matches where this check type occurred
es: Seleccionar partidas en las que se produjo este tipo de jaque

# cbBBishopP_Name
source: Pawn Promoted to Bishop
es: Peón promovido a alfil

# cbBBishopP_Description
source: Select matches where a pawn was promoted to bishop
es: Seleccionar partidas en las que un peón fue promovido a alfil

# cbKnightP_Name
source: Pawn Promoted to Knight
es: Peón promovido a caballo

# cbKnightP_Description
source: Select matches where a pawn was promoted to knight
es: Seleccionar partidas en las que un peón fue promovido a caballo

# cbRookP_Name
source: Pawn Promoted to Rook
es: Peón promovido a torre

# cbRookP_Description
source: Select matches where a pawn was promoted to rook
es: Seleccionar partidas en las que un peón ha sido promovido a torre

# cbQueenP_Name
source: Pawn Promoted to Queen
es: Peón promovido a Dama

# cbQueenP_Description
source: Select matches where a pawn was promoted to queen
es: Seleccionar partidas en las que un peón ha sido promovido a dama

# cbBBishopC_Name
source: Dark-Squared Bishop Captured
es: Alfil de casillas oscuras capturado

# cbBBishopC_Description
source: Select matches where a dark-squared bishop
es: Seleccionar partidas en las que un alfil de casillas oscuras ha sido capturado

# cbEnPassant_Name
source: Pawn Captured En Passant
es: Peón capturado al paso

# cbEnPassant_Description
source: Select matches where a pawn was captured en-passant
es: Seleccionar partidas en las que un peón ha sido capturado al paso

# cbKnightC_Name
source: Knight Captured
es: Caballo capturado

# cbKnightC_Description
source: Select matches where a knight was captured
es: Seleccionar partidas en las que se ha capturado un caballo

# cbQueenC_Name
source: Queen Captured
es: Dama capturada

# cbQueenC_Description
source: Select matches where a queen was captured
es: Seleccionar partidas en las que una dama ha sido capturada

# cbRookC_Name
source: Rook Captured
es: Torre capturada

# cbRookC_Description
source: Select matches where a rook was captured
es: Seleccionar partidas en las que se ha capturado una torre

# cbWBishopC_Name
source: Light-Squared Bishop Captured
es: Alfil de casillas claras capturado

# cbWBishopC_Description
source: Select matches where a light-squared bishop was captured
es: Seleccionar partidas en las que se ha capturado un alfil de casillas claras

# cbPawnC_Name
source: Pawn Captured
es: Peón capturado

# cbPawnC_Description
source: Select matches where a pawn was captured
es: Seleccionar partidas en las que se haya capturado un peón

# cbBBishopM_Name
source: Dark-Squared Bishop Moved
es: Alfil de casillas oscuras movido

# cbBBishopM_Description
source: The piece moved to generate the event is a dark-squared bishop
es: La pieza movida para generar el evento es un alfil de casillas oscuras

# cbKnightM_Name
source: Knight Moved
es: Caballo movido

# cbKnightM_Description
source: The piece moved to generate the event is a knight
es: La pieza movida para generar el evento es un caballo

# cbKingM_Name
source: King Moved
es: Rey movido

# cbKingM_Description
source: The piece moved to generate the event is the king
es: La pieza movida para generar el evento es el rey

# cbQueenM_Name
source: Queen Moved
es: Dama movida

# cbQueenM_Description
source: The piece moved to generate the event is a queen
es: La pieza movida para generar el evento es una dama

# cbRookM_Name
source: Rook Moved
es: Torre movida

# cbRookM_Description
source: The piece moved to generate the event is a rook
es: La pieza movida para generar el evento es una torre

# cbWBishopM_Name
source: Light-Squared Bishop Moved
es: Alfil de casillas claras movido

# cbWBishopM_Description
source: The piece moved to generate the event is a light-squared bishop
es: La pieza movida para generar el evento es un alfil de casillas claras

# cbPawnM_Name
source: Pawn Moved
es: Peón movido

# cbPawnM_Description
source: The piece moved to generate the event is a pawn
es: La pieza movida para generar el evento es un peón

# squareMenu_Name
source: Square Contextual Menu
es: Menú contextual de escaque

# squareMenu_Description
source: Show options to perform operations on this square
es: Muestra opciones para realizar operaciones en este escaque

# OPT_NOCOLOR_DESCRIPTION
source: Mark this square as of undefined color, so it can match with both light or dark squares
es: Marcar este escaque como de color indeterminado, de manera que coincida tanto con escaques claros como oscuros

# OPT_COLORBLACK_DESCRIPTION
source: Mark this square as of dark color, so it can match only with dark squares
es: Marcar este escaque como de color oscuro, de manera que coincida solo con escaques oscuros

# OPT_COLORWHITE_DESCRIPTION
source: Mark this square as of light color, so it can match only with light squares
es: Marcar este escaque como de color claro, de manera que coincida solo con escaques claros

# OPT_CLEAR_DESCRIPTION
source: Set this square as indifferent color square
es: Marcar este escaque como de color indiferente

# OPT_CLEARALL_DESCRIPTION
source: Se all empty squares as indifferent color squares
es: Marcar todos los escaques vacíos como de color indiferente

# OPT_EMPTY_DESCRIPTION
source: Mark this square as specifically empty. Only empty squares will match with it.
es: Marcar este escaque como específicamente vacío. Solo los escaques vacíos coincidirán con él.

# OPT_EMPTYALL_DESCRIPTION
source: Mark all unassigned squares as specifically empty. Only empty squares will match with them.
es: Marcar todos los escaques sin asignar como específicamente vacíos. Solo los escaques vacíos coincidirán con ellos.

# txtCustom_Name
source: Custom Regular Expression
es: Expresión regular personalizada

# txtCustom_Description
source: Type a board configuration or a regular expression for the board positions you want to find in the database
es: Escribe una configuración de tablero o una expresión regular para las posiciones que quieres encontrar en la base de datos

# bSave_Name
source: Save Board Position
es: Guardar posición del tablero

# bSave_Description
source: Add the current board piece disposition to the combobox so you can reuse it later
es: Añadir la disposición de piezas actual a la lista desplegable para poder reutilizarla más adelante

# bUse_Name
source: Use Selected Position
es: Usar la posición seleccionada

# bUse_Description
source: Get the current board position selected in the combo box and set the board piece disposition with it
es: Recuperar la posición seleccionada en la lista desplegable y configurar el tablero con ella

# cbBoards_Name
source: Stored Positions List
es: Lista de posiciones guardadas

# cbBoards_Description
source: Dropdown list of saved board piece dispositions that you can reuse
es: Lista desplegable de disposiciones de piezas en el tablero almacenadas que pueden reutilizarse

# PositionFilter_bReset_Name
source: Reset Board
es: Reiniciar tablero

# PositionFilter_bReset_Description
source: Turn board back to the initial piece disposition
es: Volver a configurar el tablero con la disposición de piezas inicial

# bClear_Name
source: Empty Board
es: Vaciar tablero

# bClear_Description
source: Clear all pieces and square configurations from the board
es: Borrar todas las piezas y configuraciones de escaque del tablero

# cbSimple_Name
source: Simple Board
es: Tablero simple

# cbSimple_Description
source: Use a regular board configuration, without regular expressions or partial board definition
es: Usar una configuración normal de tablero, sin expresiones regulares ni configuraciones parciales de escaques

# cbSimpleBoard_Name
source: Simple Board Pane
es: Panel de tablero simple

# cbSimpleBoard_Description
source: Controls to configure a simple board position filter
es: Controles para configurar un filtro de tablero simple

# txtDescription_Name
source: Stored Position Description
es: Descripción de la posición almacenada

# txtDescription_Description
source: Type a description for the board piece dipsosition you are going to add to the combobox
es: Escribe una descripción para la disposición de piezas del tablero a añadir a la lista desplegable de posiciones

# cbBoard_Name
source: Complex Board Editor
es: Editor de tablero complejo
