Repository: mdkusz/AIChessDB
Catalog: AIChessDatabase/Properties/UIResources.*.resx
Languages: es

# NAG_47
source: Black has more than adequate compensation for material deficit
es: Negras tienen una compensación más que adecuada por la pérdida de material

# NAG_48
source: White has a slight center control advantage
es: Blancas tienen una ligera ventaja de control del centro

# NAG_49
source: Black has a slight center control advantage
es: Negras tienen una ligera ventaja de control del centro

# NAG_5
source: speculative move !?
es: movimiento arriesgado !?

# NAG_50
source: White has a moderate center control advantage
es: Blancas tienen una ventaja moderada de control del centro

# NAG_51
source: Black has a moderate center control advantage
es: Negras tienen una ventaja moderada de control del centro

# NAG_52
source: White has a decisive center control advantage
es: Blancas tienen una ventaja decisiva de control del centro

# NAG_53
source: Black has a decisive center control advantage
es: Negras tienen una ventaja decisiva de control del centro

# NAG_54
source: White has a slight kingside control advantage
es: Blancas tienen una ligera ventaja en el flanco de rey

# NAG_55
source: Black has a slight kingside control advantage
es: Negras tienen una ligera ventaja en el flanco de rey

# NAG_56
source: White has a moderate kingside control advantage
es: Blancas tienen una ventaja moderada en el flanco de rey

# NAG_57
source: Black has a moderate kingside control advantage
es: Negras tienen una ventaja moderada en el flanco de rey

# NAG_58
source: White has a decisive kingside control advantage
es: Blancas tienen una ventaja decisiva en el flanco de rey

# NAG_59
source: Black has a decisive kingside control advantage
es: Negras tienen una ventaja decisiva en el flanco de rey

# NAG_6
source: questionable move ?!
es: movimiento cuestionable ?!

# NAG_60
source: White has a slight queenside control advantage
es: Blancas tienen una ligera ventaja en el flanco de dama

# NAG_61
source: Black has a slight queenside control advantage
es: Negras tienen una ligera ventaja en el flanco de dama

# NAG_62
source: White has a moderate queenside control advantage
es: Blancas tienen una ventaja moderada en el flanco de dama

# NAG_63
source: Black has a moderate queenside control advantage
es: Negras tienen una ventaja moderada en el flanco de dama

# NAG_64
source: White has a decisive queenside control advantage
es: Blancas tienen una ventaja decisiva en el flanco de dama

# NAG_65
source: Black has a decisive queenside control advantage
es: Negras tienen una ventaja decisiva en el flanco de dama

# NAG_66
source: White has a vulnerable first rank
es: Blancas tienen una primera fila vulnerable

# NAG_67
source: Black has a vulnerable first rank
es: Negras tienen una primera fila vulnerable

# NAG_68
source: White has a well protected first rank
es: Blancas tienen una primera fila bien protegida

# NAG_69
source: Black has a well protected first rank
es: Negras tienen una primera fila bien protegida

# NAG_7
source: forced move (all others lose quickly)
es: movimiento forzado (los demás pierden rápidamente)

# NAG_70
source: White has a poorly protected king
es: Blancas tienen el rey desprotegido

# NAG_71
source: Black has a poorly protected king
es: Negras tienen el rey desprotegido

# NAG_72
source: White has a well protected king
es: Blancas tienen el rey bien defendido

# NAG_73
source: Black has a well protected king
es: Negras tienen el rey bien defendido

# NAG_74
source: White has a poorly placed king
es: Blancas tienen el rey mal posicionado

# NAG_75
source: Black has a poorly placed king
es: Negras tienen el rey mal posicionado

# NAG_76
source: White has a well placed king
es: Blancas tienen el rey bien posicionado

# NAG_77
source: Black has a well placed king
es: Negras tienen el rey bien posicionado

# NAG_78
source: White has a very weak pawn structure
es: Blancas tienen una estructura de peones muy débil

# NAG_79
source: Black has a very weak pawn structure
es: Negras tienen una estructura de peones muy débil

# NAG_8
source: singular move (no reasonable alternatives)
es: movimiento único (sin alternativas razonables)

# NAG_80
source: White has a moderately weak pawn structure
es: Blancas tienen una estructura de peones moderadamente débil

# NAG_81
source: Black has a moderately weak pawn structure
es: Negras tienen una estructura de peones moderadamente débil

# NAG_82
source: White has a moderately strong pawn structure
es: Blancas tienen una estructura de peones moderadamente fuerte

# NAG_83
source: Black has a moderately strong pawn structure
es: Negras tienen una estructura de peones moderadamente fuerte

# NAG_84
source: White has a very strong pawn structure
es: Blancas tienen una estructura de peones muy fuerte

# NAG_85
source: Black has a very strong pawn structure
es: Negras tienen una estructura de peones muy fuerte

# NAG_86
source: White has poor knight placement
es: Blancas tienen el caballo mal posicionado

# NAG_87
source: Black has poor knight placement
es: Negras tienen el caballo mal posicionado

# NAG_88
source: White has good knight placement
es: Blancas tienen el caballo bien posicionado

# NAG_89
source: Black has good knight placement
es: Negras tienen el caballo bien posicionado

# NAG_9
source: worst move
es: peor movimiento

# NAG_90
source: White has poor bishop placement
es: Blancas tienen el alfil mal posicionado

# NAG_91
source: Black has poor bishop placement
es: Negras tienen el alfil mal posicionado

# NAG_92
source: White has good bishop placement
es: Blancas tienen el alfil bien posicionado

# NAG_93
source: Black has good bishop placement
es: Negras tienen el alfil bien posicionado

# NAG_94
source: White has poor rook placement
es: Blancas tienen la torre mal posicionada

# NAG_95
source: Black has poor rook placement
es: Negras tienen la torre mal posicionada

# NAG_96
source: White has good rook placement
es: Blancas tienen la torre bien posicionada

# NAG_97
source: Black has good rook placement
es: Negras tienen la torre bien posicionada

# NAG_98
source: White has poor queen placement
es: Blancas tienen la dama mal posicionada

# NAG_99
source: Black has poor queen placement
es: Negras tienen la dama mal posicionada

# NAME_BPLAYER
source: Black
es: Negras

# NAME_COMPOSITECONDITION
source: Composite Filter Condition
es: Condición de filtro compuesta

# NAME_DBDEFAULT
source: New Filter Collection
es: Nueva colección de filtros

# NAME_MULTIPOS
source: Multiple alternative positions
es: Posiciones alternativas múltiples

# NAME_PARTPOS
source: Partial position
es: Posición parcial

# NAME_SIMPLEPOS
source: Absolute position
es: Posición absoluta

# NAME_TOMOVE
source: to play
es: juegan

# NAME_UNDEFINED
source: Undefined
es: No definido

# NAME_UNKNOWN
source: Unknown
es: Desconocido

# NAME_WPLAYER
source: White
es: Blancas

# OPN_BITAND
source: Has Event
es: Contiene evento

# OPN_EQUALS
source: Equals
es: Igual

# OPN_FIRST
source: First
es: Primero

# OPN_FIRSTPLUS
source: First+{0}
es: Primero+{0}

# OPN_FIRSTPLUSN
source: First +
es: Primero +

# OPN_GREATERTHAN
source: Greater than
es: Mayor que

# OPN_GREATERTHANOREQUAL
source: Greater than or Equal
es: Mayor o igual que

# OPN_IN
source: In Set
es: En el conjunto

# OPN_INRANGE
source: In Range
es: En el rango

# OPN_LESSTHAN
source: Less than
es: Menor que

# OPN_LESSTHANOREQUAL
source: Less than or Equal
es: Menor o igual que

# OPN_LIKE
source: Contains
es: Contiene

# OPN_NEXT
source: Among the next...
es: Entre los siguientes...

# OPN_NEXTN
source: After
es: Posterior

# OPN_NOTBITAND
source: Not Has Event
es: No contiene evento

# OPN_NOTEQUALS
source: Different to
es: Diferente a

# OPN_NOTIN
source: Not in Set
es: No en el conjunto

# OPN_NOTINRANGE
source: Not in Range
es: No en el rango

# OPN_NOTLIKE
source: Not Contains
es: No contiene

# OPN_NOTNULL
source: Not Blank
es: No vacío

# OPN_NOTREGEX
source: Not Matches Pattern
es: No se ajusta al patrón

# OPN_NULL
source: Blank
es: Vacío

# OPN_REGEX
source: Matches Pattern
es: Se ajusta al patrón

# OPT_BULKIMPORTPGN
source: Import Multiple Files...
es: Importar múltiples archivos...

# OPT_CASCADE
source: Cascade
es: Cascada

# OPT_CLEAR
source: No Matter Square
es: Escaque ignorado

# OPT_CLEARALL
source: Change all Empty to No Matter Square
es: Cambiar todos los escaques vacíos a ignorados

# OPT_COLORBLACK
source: Dark Square
es: Escaque oscuro

# OPT_COLORWHITE
source: Light Square
es: Escaque claro

# OPT_CONSOLIDATE
source: Consolidate Keyword Values
es: Fusionar valores de etiquetas

# OPT_CREDITS
source: Credits
es: Créditos

# OPT_EMPTY
source: Force to Empty Sqare
es: Forzar a escaque vacío

# OPT_EMPTYALL
source: Force all Unassigned to Empty Sqare
es: Forcar todos los escaques sin asignar a vacíos

# OPT_EXIT
source: Exit
es: Salir

# OPT_EXPORTDB
source: Export Database
es: Exportar base de datos

# OPT_HELP
source: Help
es: Ayuda

# OPT_IMPORTPGN
source: Import File...
es: Importar archivo...

# OPT_LOADRES
source: Open Results Data...
es: Abrir resultados de consulta...

# OPT_MATCHFILTEREDITOR
source: Match Filter Editor
es: Editor de filtros de partida

# OPT_MOVEEDITOR
source: Move Filter Editor
es: Editor de filtros de movimiento

# OPT_NEWDATABASE
source: New Filter Collection
es: Nueva colección de filtros

# OPT_NEWMATCH
source: New Match
es: Nueva partida

# OPT_NEWQUERY
source: New Query
es: Nueva consulta

# OPT_NOCOLOR
source: Indifferent Color Square
es: Escaque de color indiferente

# OPT_OPENDB
source: Open Filter Collection...
es: Abrir coleción de filtros...

# OPT_SAVEDB
source: Save Filter Collection
es: Guardar colección de filtros

# OPT_SAVEDBAS
source: Save Filter Collection as...
es: Guardar colección de filtros como...

# OPT_SAVEMATCHESFILE
source: Save Selected Matches to File...
es: Guardar partidas seleccionadas en archivo...

# OPT_SAVERES
source: Save Results...
es: Guardar resultados...

# OPT_TILEH
source: Tile Horizontal
es: Mosaico horizontal

# OPT_TILEV
source: Tile Vertical
es: Mosaico vertical

# POSITION_EVENT_DESCRIPTION
source: Last move result in the position (check, checkmate, capture, etc.)
es: Último resultado del movimiento en la posición (jaque, jaque mate, captura, etc.)

# POSITION_EVENT_NAME
source: Position event
es: Evento de posición

# PST_MATCHCOUNT
source: Matches where this position has occurred
es: Partidas en las que se ha llegado a esta posición

# PST_OCCURCOUNT
source: Times this position has occurred
es: Veces que se ha dado esta posición

# PZ_ANY
source: Any piece
es: Cualquier pieza

# PZ_BISHOP
source: Bishop
es: Alfil

# PZ_KING
source: King
es: Rey

# PZ_KNIGHT
source: Knight
es: Caballo

# PZ_PAWN
source: Pawn
es: Peón

# PZ_QUEEN
source: Queen
es: Dama

# PZ_ROOK
source: Rook
es: Torre

# RB_BLACKMOVE
source: Black to Move
es: Negras mueven

# RB_WHITEMOVE
source: White to Move
es: Blancas mueven

# SEP_AND
source: and
es: y

# SEP_FROM
source: from
es: desde

# SEP_OR
source: or
es: o

# SEP_TO
source: to
es: hasta

# TTL_BULKCOPY
source: Export Database from {0}
es: Exportar base de datos desde {0}

# TTL_BULKPGNIMPORT
source: Bulk Import Files Into {0}
es: Importación en bloque de archivos en {0}

# TTL_CONSOLIDATE
source: Consolidate Keywords on {0}
es: Fusionar etiquetas en {0}

# TTL_DUPLICATES
source: Allow Duplicates
es: Permitir duplicados

# TTL_FILTERDATABASE
source: Filter Collection: {0}
es: Colección de filtros: {0}

# TTL_INITIALPOS
source: Set Initial Position
es: Establecer posición inicial

# TTL_LABELMATCHES
source: Define Match Keyword
es: Definir etiqueta de partida

# TTL_MAINFORM
source: Chess Database
es: Base de datos de partidas de ajedrez

# TTL_MATCHFILTER
source: Match Filter Editor: {0}
es: Editor de filtros de partida: {0}

# TTL_MATCHINFO
source: Match Info Editor
es: Editor de información de partida

# TTL_MOVEFILTER
source: Move Filter Editor: {0}
es: Editor de filtros de movimiento: {0}

# TTL_MOVEPIECESED
source: Move Events Editor
es: Editor de eventos de movimiento

# TTL_MULTICHOICEEDITOR
source: {0} Filter Editor
es: Editor de filtros {0}

# TTL_NEW
source: (New)
es: (Nuevo)

# TTL_NEWMATCH
source: New Match Data
es: Datos nueva partida

# TTL_PGNERROR
source: Save Errors to File
es: Guardar erróneos en archivo

# TTL_PGNWINDOW
source: Import File {0} into {1}
es: Importar archivo {0} en {1}

# TTL_PIECECOUNT
source: Piece Count
es: Cuenta de piezas

# TTL_POSITIONEDITOR
source: Position Editor
es: Editor de posiciones

# TTL_QUERY
source: Query on {0}
es: Consulta en {0}

# TTP_ADDMOVE
source: Add Ply
es: Añadir movimiento

# TTP_ADDMOVEE
source: Add Move
es: Añadir movimiento

# TTP_ADDNEWTODB
source: Add New Copy to Collection
es: Añadir nueva copia a colección de filtros

# TTP_ADDTODB
source: Add to / Update in Collection
es: Añadir a / Actualizar en colección de filtros

# TTP_BACK
source: Back
es: Atrás

# TTP_BGINSERTCHECKED
source: Background Insert Checked Rows in Database
es: Insertar las partidas marcadas en la base de datos (proceso de fondo)

# TTP_CHECKROWS
source: Check Selected Rows
es: Marcar las filas seleccionadas

# TTP_DELFILTER
source: Delete Filter
es: Eliminar filtro

# TTP_DELMATCH
source: Delete Selected Matches
es: Eliminar partidas seleccionadas

# TTP_DELMOVE
source: Remove Last Ply
es: Eliminar último movimiento

# TTP_DELMOVE1
source: Remove Last Move
es: Eliminar último movimiento

# TTP_DELRESULTS
source: Delete Selected Results
es: Eliminar resultados seleccionados

# TTP_EDITFILTER
source: Edit Filter
es: Editar filtro

# TTP_EDITMATCH
source: Edit Selected Match
es: Editar partida seleccionada

# TTP_EXPORTDB
source: Export to Another Database
es: Exportar a otra base de datos

# TTP_EXPPGN
source: Export Selection to PGN File
es: Exportar selección a archivo PGN

# TTP_FINDPOS
source: Find Position in Database
es: Buscar posición en base de datos

# TTP_INITIALPOS
source: Set Initial Position
es: Establecer posición inicial

# TTP_INSERTCHECKED
source: Insert Checked Rows in Database
es: Insertar partidas marcadas en la base de datos

# TTP_LABELMATCHES
source: Label Selected Matches
es: Etiquetar partidas seleccionadas

# TTP_MARKMSQUARE
source: Mark Move Squares
es: Marcar escaques del movimiento

# TTP_NEWMATCHFILTER
source: New Match Filter
es: Nuevo filtro de partida

# TTP_NEWMOVEFILTER
source: New Move Filter
es: Nuevo filtro de movimiento

# TTP_NEXT
source: Next
es: Siguiente

# TTP_PLAYMATCH
source: Play Match
es: Jugar partida

# TTP_QUERY
source: Query Database
es: Consultar la base de datos

# TTP_READLEFTRIGHT
source: Read Left-Right and Top-Down
es: Leer de izquierda a derecha y de arriba a abajo

# TTP_READTOPDOWN
source: Read Top-Down and Left-Right
es: Leer de arriba abajo y de izquierda a derecha

# TTP_REFRESH
source: Refresh
es: Refrescar

# TTP_RESET
source: Reset
es: Reiniciar

# TTP_ROTATEVIEW
source: Rotate View
es: Rotar vista

# TTP_SELALL
source: Select All
es: Seleccionar todo

# TTP_UNCHECKROWS
source: Uncheck Selected Rows
es: Quitar marca a filas seleccionadas

# TTP_VIEWMATCH
source: View Selected Match
es: Ver partida seleccionada

# TXT_ALLCONDITIONS
source: All of those conditions
es: Todas estas condiciones

# TXT_DESTFILE
source: One binary file
es: Un solo archivo binario

# TXT_DESTFILES
source: One binary file by chunck
es: Un archivo binario por cada bloque

# TXT_SOMECONDITIONS
source: One or more of those conditions
es: Una o más de estas condiciones

# URL_HELP
source: http://software-tecnico-libre.es/en/article-by-topic/all-sections/all-topics/all-articles/chessposdb-user-guide-1
es: http://software-tecnico-libre.es/es/articulo-por-tema/todas-las-secciones/todos-los-temas/todos-los-articulos/chessposdb-manual-de-usuario-1

# DN_code
source: Code
es: Código

# DES_code
source: Unique identifier
es: Identificador único

# DN_keyword
source: Keyword
es: Etiqueta

# DES_keyword
source: Descriptive tag for the match (players, location, event, etc.)
es: Etiqueta descriptiva del match (jugadores, lugar, evento, etc.)

# DN_keyword_type
source: Keyword type
es: Tipo de etiqueta

# DES_keyword_type
source: Keyword classification name
es: Clasificación de la etiqueta

# DN_description
source: Description
es: Descripción

# DES_match_description
source: Match description
es: Descripción de la partida

# DN_result
source: Result
es: Resultado

# DES_result
source: Match result (0 = *, 1 = 1-0, 2 = 0-1, 3 = 1/2-1/2)
es: Resultado de la partida (0 = *, 1 = 1-0, 2 = 0-1, 3 = 1/2-1/2)

# DN_date
source: Date
es: Fecha

# DES_match_date
source: Match date
es: Fecha de la partida

# DN_white
source: White
es: Blancas

# DES_white
source: White player name
es: Nombre del jugador con las blancas

# DN_black
source: Black
es: Negras

# DES_black
source: Black player name
es: Nombre del jugador con las negras

# DN_result_text
source: Result (Text)
es: Resultado (texto)

# DES_result_text
source: Result translated to standard text
es: Resultado traducido a texto estándar

# DN_move_count
source: Moves
es: Movimientos

# DES_move_count
source: Move count
es: Cuenta de movimientos

# DN_fullmove_count
source: Full Moves
es: Jugadas

# DES_fullmove_count
source: Full moves count
es: Cuenta de jugadas

# DN_move_number
source: Move
es: Jugada

# DES_move_number
source: Full move number
es: Número de jugada

# DN_move_order
source: Order
es: Movimiento

# DES_move_order
source: Move order number
es: Número de movimiento

# DN_move_player
source: Player
es: Jugador

# DES_move_player
source: Player number: 0 = white, 1 = black
es: Número de jugador: 0 =blancas, 1 =negras

# DN_move_an_text
source: AN Text
es: Texto AN

# DES_move_an_text
source: Movement as standardized text
es: Texto estandarizado del movimiento

# DN_score
source: Score
es: Puntuación

# DES_move_score
source: Move score
es: Puntuación del movimiento

# DN_comment_order
source: Comment
es: Comentario

# DES_comment_order
source: Move comment number
es: Número de comentario del movimiento

# DN_comment_text
source: Text
es: Texto

# DES_comment_text
source: Comment text
es: Texto del comentario

# DN_value
source: Value
es: Valor

# DES_keyword_value
source: Value assigned to keyword
es: Valor asignado a la etiqueta

# DES_statistic
source: Descriptive tag for the statistic
es: Etiqueta descriptiva de la estadística

# DES_statistic_value
source: Statistic value
es: Valor de la estadística

# DES_event_description
source: Event description
es: Descripción del evento

# DES_pos_score
source: Position score
es: Puntuación de la posición

# DN_pos_order
source: Order
es: Movimiento

# DN_board
source: Board
es: Tablero

# DES_board
source: Pieces disposition in the board
es: Disposición de las piezas en el tablero

# DN_w_pawns
source: White Pawns
es: Peones Blancos

# DES_w_pawns
source: White pawns count
es: Cuenta de peones blancos

# DN_b_pawns
source: Black Pawns
es: Peones negros

# DES_b_pawns
source: Black pawns count
es: Cuenta de peones negros

# DN_w_rooks
source: White Rooks
es: Torres Blancas

# DES_w_rooks
source: White rooks count
es: Cuenta de torres blancas

# DN_b_rooks
source: Black Rooks
es: Torres negras

# DES_b_rooks
source: Black rook count
es: Cuenta de torres negras

# DN_w_knights
source: White Knights
es: Caballos blancos

# DES_w_knights
source: White knights count
es: Cuenta de caballos blancos

# DN_b_knights
source: Black Knights
es: Caballos negros

# DES_b_knights
source: Black knight count
es: Cuenta de caballos negros

# DN_w_bishops
source: White Bishops
es: Alfiles blancos

# DES_w_bishops
source: White bishop count
es: Cuenta de alfiles blancos

# DN_b_bishops
source: Black Bishops
es: Alfiles negros

# DES_b_bishops
source: Black bishop count
es: Cuenta de alfiles negros

# DN_w_queens
source: White Queens
es: Reinas blancas

# DES_w_queens
source: White queen count
es: Cuenta de reinas blancas

# DN_b_queens
source: Black Queens
es: Reinas negras

# DES_b_queens
source: Black queen count
es: Cuenta de reinas negras

# LCAT_MOVE
source: MOVE
es: JUGADA

# COL_KEYWORD
source: Match Keyword
es: Etiqueta de partida

# COL_KEYWORDVALUE
source: Keyword Value
es: Valor de etiqueta

# COL_MATCHSTS
source: Match Statistic
es: Estadística de partida

# COL_MATCHSTSVALUE
source: Statistic Value
es: Valor de estadística

# CAT_KEYWORDS
source: Keywords
es: Etiquetas

# CAT_STATISTICS
source: Statistics
es: Estadísitcas

# COL_INITIALBOARD
source: Initial Board
es: Tablero inicial

# CAT_INITIALPOS
source: Match Initial Position
es: Posición inicial de la partida

# COL_INITAIALBPAWNS
source: Initial Black Pawns
es: Peones negros iniciales

# COL_initial_white_pawns
source: Initial White Pawns
es: Peones blancos iniciales

# COL_initial_black_rooks
source: Initial Black Rooks
es: Torres negras iniciales

# COL_initial_white_rooks
source: Initial White Rooks
es: Torres blancas iniciales

# COL_initial_black_bishops
source: Initial Black Bishops
es: Alfiles negros iniciales

# COL_initial_white_bishops
source: Initial White Bishops
es: Alfiles blancos iniciales

# COL_initial_black_knights
source: Initial Black Knights
es: Caballos negros iniciales

# COL_initial_white_knights
source: Initial White Knights
es: Caballos blancos iniciales

# COL_initial_black_queens
source: Initial Black Queens
es: Reinas negras iniciales

# COL_initial_white_queens
source: Initial White Queens
es: Reinas blancas iniciales

# CAT_GENMOVE
source: Move Data
es: Datos del movimiento

# COL_MOVE_ORDER
source: Ply Number
es: Movimiento

# COL_MOVE_NUMBER
source: Move Number
es: Jugada

# COL_MOVE_PLAYER
source: Player
es: Jugador

# COL_MOVE_EVENTS
source: Ply Events
es: Eventos del movimiento

# COL_MOVE_AN_TEXT
source: Ply Text
es: Texto del movimiento

# COL_COMMENTS
source: Comments
es: Comentarios

# COL_SCORE
source: Score
es: Puntuación

# COL_MOVE_FROM
source: From Square
es: Desde escaque

# COL_from_board
source: From Position
es: Desde Posición

# COL_from_black_pawns
source: From Black Pawns
es: Peones negros antes

# COL_from_white_pawns
source: From White Pawns
es: Peones blancos antes

# COL_from_black_rooks
source: From Black Rooks
es: Torres negras antes

# COL_from_white_rooks
source: From White Rooks
es: Torres blancas antes

# COL_from_black_bishops
source: From Black Bishops
es: Alfiles negros antes

# COL_from_white_bishops
source: From White Bishops
es: Alfiles blancos antes

# COL_from_black_knights
source: From Black Knights
es: Caballos negors antes

# COL_from_white_knights
source: From White Knights
es: Caballos blancos antes

# COL_from_black_queens
source: From Black Queens
es: Reinas negras antes

# COL_from_white_queens
source: From White Queens
es: Reinas blancas antes

# CAT_MOVEFROM
source: From Move
es: Desde movimiento

# COL_MOVE_TO
source: To Square
es: Hasta escaque

# COL_to_board
source: To Board
es: Hasta posición

# COL_to_black_pawns
source: To Black Pawns
es: Peones negros después

# COL_to_white_pawns
source: To White Pawns
es: Peones blancoss después

# COL_to_black_rooks
source: To Black Rooks
es: Torres negras después

# COL_to_white_rooks
source: To White Rooks
es: Torres blancas después

# COL_to_black_bishops
source: To Black Bishops
es: Alfiles negros después

# COL_to_white_bishops
source: To White Bishops
es: Alfiles blancos después

# COL_to_black_knights
source: To Black Nights
es: Caballos negros después

# COL_to_white_knights
source: To White Knights
es: Caballos blancos después

# COL_to_black_queens
source: To Black Queens
es: Reinas negras después

# COL_to_white_queens
source: To White Queens
es: Reinas blancas después

# CAT_MOVETO
source: To Move
es: Hasta movimiento

# COL_POSITION_ORDER
source: Position Order
es: Orden de la posición

# COL_POSITION_EVENTS
source: Position Events
es: Eventos en la posición

# COL_board
source: Board
es: Tablero

# COL_black_pawns
source: Black Pawns
es: Peones negros
