Repository: mdkusz/AIChessDB
Catalog: AIChessDatabase/Properties/UIResources.*.resx
Languages: es

# BTN_ADD
source: Add
es: Añadir

# BTN_CANCEL
source: Cancel
es: Cancelar

# BTN_CANCELCHG
source: Cancel Changes
es: Cancelar cambios

# BTN_CHANGE
source: Change
es: Cambiar

# BTN_CHANGEMODE
source: Change condition join mode
es: Cambiar modo de enlace

# BTN_CLEAR
source: Clear
es: Vaciar

# BTN_CLOSE
source: Close
es: Cerrar

# BTN_CONSOLIDATE
source: Consolidate
es: Fusionar

# BTN_DELETE
source: Delete
es: Eliminar

# BTN_DELETEFILTER
source: Delete Filter
es: Borrar filtro

# BTN_EDIT
source: Edit
es: Editar

# BTN_EXPORT
source: Export
es: Exportar

# BTN_IMPORT
source: Import
es: Importar

# BTN_NEWCOMMENT
source: New Comment
es: Nuevo comentario

# BTN_RESET
source: Reset
es: Inicial

# BTN_SAVE
source: Save
es: Guardar

# BTN_SELFILES
source: Select Files...
es: Seleccionar archivos...

# BTN_UPDATE
source: Update Changes
es: Actualizar cambios

# BTN_USE
source: Use
es: Usar

# CAP_QUESTION
source: Question
es: Pregunta

# CB_COPYDUPLICATES
source: Copy Duplicate Matches
es: Copiar partidas duplicadas

# CB_DELETEPGNFILES
source: Delete Files After Import
es: Eliminar archivos después de la importación

# CB_DUPLICATES
source: Import Duplicate Matches
es: Importar partidas duplicadas

# CB_SIMPLEBOARDED
source: Simple Editor
es: Editor simple

# CB_USEFILTER
source: Use Filter
es: Usar filtro

# COL_BLACK
source: Black
es: Negras

# COL_DATE
source: Date
es: Fecha

# COL_FMOVES
source: Moves
es: Jugadas

# COL_MATCH
source: Match
es: Partida

# COL_MOVES
source: Ply
es: Movimientos

# COL_RESULT
source: Result
es: Resultado

# COL_SELECTED
source: Selected
es: Seleccionado

# COL_WHITE
source: White
es: Blancas

# ERR_BADBLACKMOVE
source: Bad black move
es: Movimiento de las negras incorrecto

# ERR_BADBOARD
source: Chess board incomplete
es: Tablero incompleto

# ERR_BADCHOICENOTKW
source: Bad filter choice, not a keyword
es: Elección de filtro incorrecta, no es una etiqueta

# ERR_BADMOVE
source: Bad move
es: Movimiento incorrecto

# ERR_BADMOVENUMBER
source: Bad move number format
es: Formato de número de movimiento incorrecto

# ERR_BADOPERATOR
source: Bad filter operator
es: Operador de filtro incorrecto

# ERR_BADPIECEVALUE
source: Bad piece value
es: Valor de pieza incorrecto

# ERR_BADPLAYERNUMBER
source: Bad player number
es: Número de jugador incorrecto

# ERR_BADPOSITION
source: Bad piece position
es: Posición de pieza incorrecta

# ERR_BADWHITEMOVE
source: Bad white move
es: Movimiento de las blancas incorrecto

# ERR_CONTNOTSERIALIZABLE
source: Container not serializable
es: El contenedor no admite guardado

# ERR_DBNOTFOUND
source: FIlter not found
es: Filtro no encontrado

# ERR_ELMNOTSERIALIZABLE
source: Element not serializable
es: El elemento no admite guardado

# ERR_ENDLESS
source: Endless loop
es: Bucle infinito

# ERR_INCOMPATIBLETYPES
source: Incomaptible types
es: Tipos incompatibles

# ERR_NOATTRIBUTENAME
source: Bad attribute name
es: Nombre de atributo incorrecto

# ERR_NOATTRIBUTEVALUE
source: Bad attribute value
es: Valor de atributo incorrecto

# ERR_NOEVENLABEL
source: First "Event" label not found
es: No se encuentra la primera etiqueta "Event"

# ERR_NOPARAMTYPE
source: Param type needed
es: El tipo del parámetro es necesario

# ERR_NOREPOSITORY
source: No database repository defined
es: No se ha definido un repositorio de base de datos

# ERR_NOTRANSLATOR
source: No SQL translator defined
es: No se ha definido ningún traductor SQL

# ERR_OPERATION_NOTALLOWED
source: Operation not allowed
es: Operación no permitida

# ERR_REPOSITORYNOC
source: Database repository not compatible
es: Repositiorio de base de datos incompatible

# ERR_SINGLEVALUEREQUIRED
source: Single value required
es: Se requiere un solo valor

# ERR_STFILTERNF
source: Filter not found
es: Filtro no encontrado

# ERR_VALUEREQUIRED
source: Value required
es: Se requiere un valor

# ERR_XMLNOTVALID
source: Invalid XML schema
es: Esquema XML incorrecto

# EVENT_BBISHOP1
source: Dark Bishop
es: Alfil oscuras

# EVENT_BBISHOP11
source: Dark Bishop
es: Alfil oscuras

# EVENT_BBISHOP2
source: Dark Bishop
es: Alfil oscuras

# EVENT_BBISHOP21
source: Dark Bishop
es: Alfil oscuras

# EVENT_BISHOP
source: Bishop
es: Alfil

# EVENT_CAPTURE
source: Captures
es: Captura

# EVENT_CAPTURE1
source: Captures
es: Captura

# EVENT_CASTLE
source: Castling
es: Enroque

# EVENT_CASTLE1
source: Castling
es: Enroque

# EVENT_CASTLEK
source: Kingside castling
es: Enroque lado de rey

# EVENT_CASTLEK1
source: Kingside castling
es: Enroque lado del rey

# EVENT_CASTLEQ
source: Queenside castling
es: Enroque lado de dama

# EVENT_CASTLEQ1
source: Queenside castling
es: Enroque lado de dama

# EVENT_CHECK
source: Check
es: Jaque

# EVENT_CHECK1
source: Check
es: Jaque

# EVENT_CHECKMATE
source: Checkmate
es: Jaque mate

# EVENT_CHECK_MATE
source: Checkmate
es: Jaque mate

# EVENT_DISCOVERED_CHECK
source: Discovered check
es: Jaque descubierto

# EVENT_DISCOVERED_CHECK1
source: Discovered check
es: Jaque descubierto

# EVENT_DRAW_OFFER
source: Draw offer
es: Oferta tablas

# EVENT_DRAW_OFFER1
source: Draw offer
es: Oferta de tablas

# EVENT_KING1
source: King
es: Rey

# EVENT_KING11
source: King
es: Rey

# EVENT_KNIGHT1
source: Knight
es: Caballo

# EVENT_KNIGHT11
source: Knight
es: Caballo

# EVENT_KNIGHT2
source: Knight
es: Caballo

# EVENT_KNIGHT21
source: Knight
es: Caballo

# EVENT_MOVE
source: Moves
es: Mueve

# EVENT_MOVE1
source: Moves
es: Mueve

# EVENT_MULTIPLE_CHECK
source: Multiple check
es: Jaque múltiple

# EVENT_MULTIPLE_CHECK1
source: Multiple check
es: Jaque múltiple

# EVENT_PAWN1
source: Pawn
es: Peón

# EVENT_PAWN11
source: Pawn
es: Peón

# EVENT_PAWN2
source: Pawn
es: Peón

# EVENT_PAWN21
source: Pawn
es: Peón

# EVENT_PAWN_PASSANT
source: En passant
es: Al paso

# EVENT_PAWN_PASSANT1
source: En passant
es: Al paso

# EVENT_PAWN_PROMOTED
source: Pawn promoted
es: Peón coronado

# EVENT_PAWN_PROMOTED1
source: Pawn promoted
es: Peón coronado

# EVENT_QUEEN1
source: Queen
es: Dama

# EVENT_QUEEN11
source: Queen
es: Dama

# EVENT_QUEEN2
source: Queen
es: Dama

# EVENT_QUEEN21
source: Queen
es: Dama

# EVENT_ROOK1
source: Rook
es: Torre

# EVENT_ROOK11
source: Rook
es: Torre

# EVENT_ROOK2
source: Rook
es: Torre

# EVENT_ROOK21
source: Rook
es: Torre

# EVENT_WBISHOP1
source: Light Bishop
es: Alfil claras

# EVENT_WBISHOP11
source: Light Bishop
es: Alfil claras

# EVENT_WBISHOP2
source: Light Bishop
es: Alfil claras

# EVENT_WBISHOP21
source: Light Bishop
es: Alfil claras

# FIL_MATCHES
source: Binary Match Files (*.bmf)|*.bmf|All Files (*.*)|*.*
es: Archivos binarios de partida (*.bmf)|*.bmf|Todos los archivos (*.*)|*.*

# FIL_PGN
source: PGN Files (*.pgn)|*.pgn|Binary Match Files (*.bmf)|*.bmf|All Files (*.*)|*.*
es: Archivos PGN (*.pgn)|*.pgn|Archivos binarios de partida (*.bmf)|*.bmf|Todos los archivos (*.*)|*.*

# FIL_QRS
source: Query Result Files (*.qrs)|*.qrs|All Files (*.*)|*.*
es: Archivos de resultados de consulta (*.qrs)|*.qrs|Todos los archivos (*.*)|*.*

# FIL_XML
source: XML Files (*.xml)|*.xml|All Files (*.*)|*.*
es: Archivos XML (*.xml)|*.xml|Todos los archivos (*.*)|*.*

# FNAME_MATCHINFO
source: Match Information
es: Información de partida

# FNAME_MATCHKEYWORD
source: Match Keyword
es: Etiqueta de partida

# FNAME_MATCHSTS
source: Match Statistic
es: Estadística de partida

# FNAME_MOVEFILTER
source: Move or Position
es: Movimiento o posición

# FNAME_MOVEPIECE
source: Moving / Capturing Piece
es: Pieza que mueve / captura

# FNAME_PLAYER
source: Color to Play
es: Turno de jugador

# FNAME_POSITION
source: Position Definition
es: Definición de posición

# FNAME_POSSTS
source: Position Statistics
es: Estadística de posición

# FNAME_PZCOUNT
source: Piece Count
es: Cuenta de piezas

# FNAME_SQUARES
source: Move From - To Square
es: Mover desde - hasta escaque

# GRP_MATCHKEYS
source: Match Keywords
es: Etiquetas de partida

# GRP_MATCHSTS
source: Match Statistics
es: Estadísticas de partida

# GRP_PAWNPROMOTED
source: Pawn Promoted to
es: Peón promovido a

# GRP_PIECECAPTURED
source: Captured Piece
es: Pieza capturada

# GRP_POSSTS
source: Position Statistics
es: Estadísticas de posición

# GRP_PZMOVE
source: Piece to Move
es: Pieza que mueve

# KW_DESCRIPTION_DESCRIPTION
source: Keyword description
es: Deescripción de etiqueta

# KW_DESCRIPTION_NAME
source: Description
es: Descripción

# KW_KEYWORD_DESCRIPTION
source: Keyword name
es: Nombre de etiqueta

# KW_KEYWORD_NAME
source: Keyword name
es: Nombre de etiqueta

# KW_KW_VALUE_DESCRIPTION
source: Keyword value
es: Valor de etiqueta

# KW_KW_VALUE_NAME
source: Keyword value
es: Valor de etiqueta

# LAB_ADDNEW
source: Add New:
es: Añadir nuevo:

# LAB_APPICON
source: Application Icon:
es: Icono aplicación:

# LAB_AUTHOR
source: Author:
es: Autor:

# LAB_BLACK
source: Black
es: Negras

# LAB_CANONICAL
source: Canonical Value
es: Valor canónico

# LAB_CASTLE
source: Castling
es: Enroque

# LAB_CHECK
source: Check
es: Jaque

# LAB_CHUNKSIZE
source: Copy Chunks of Size
es: Copiar bloques de tamaño

# LAB_COMMENTS
source: Comments
es: Comentarios

# LAB_CUSTOM
source: Custom Expression
es: Expresión a medida

# LAB_DATE
source: Date
es: Fecha

# LAB_DESCRIPTION
source: Description
es: Descripción

# LAB_DESTDB
source: Destination Database
es: Base de datos de destino

# LAB_EQUIVALENCES
source: Equivalences
es: Equivalencias

# LAB_FILES
source: Files
es: Archivos

# LAB_FILNAME
source: Filter Name
es: Nombre del filtro

# LAB_FILTER
source: FIlter
es: Filtro

# LAB_FROM
source: From
es: Desde

# LAB_FULLMOVES
source: Moves
es: Jugadas

# LAB_ITEMS
source: Items
es: Elementos

# LAB_KEYWORD
source: Keyword
es: Etiqueta

# LAB_MATCH
source: Match
es: Partida

# LAB_MATCHCOUNT
source: {0} Matches in the Source Database
es: {0} Partidas en la base de datos origen

# LAB_MATCHES
source: Matches
es: Partidas

# LAB_MATCHSEL
source: {0} Matches, {1} Selected
es: {0} Partidas, {1} Seleccionadas

# LAB_MOVES
source: Ply
es: Movimientos

# LAB_NAME
source: Name
es: Nombre

# LAB_OPERATION
source: Test Operation
es: Operación

# LAB_PIECESET
source: Piece Set:
es: Piezas:

# LAB_RESULT
source: Result
es: Resultado

# LAB_RESULTCNT
source: {0} Matches
es: {0} Partidas

# LAB_STOREDBOARDS
source: Stored Boards
es: Tableros guardados

# LAB_TO
source: To
es: Hasta

# LAB_VALUE
source: Value
es: Valor

# LAB_VALUES
source: Values
es: Valores

# LAB_WHITE
source: White
es: Blancas

# LAB_WHITEBLACK
source: White/Black
es: Blancas/Negras

# MATCH_DESCRIPTION_DESCRIPTION
source: Match description
es: Descripción de partida

# MATCH_DESCRIPTION_NAME
source: Match description
es: Descripción de partida

# MATCH_RESULTTEXT_DESCRIPTION
source: * =not finished, 1-0 =white wins, 0-1 =black wins, 1/2-1/2 = draw
es: * = no terminado, 1-0 = blancas ganan, 0-1 = negras ganan, 1/2-1/2 = tablas

# MATCH_RESULTTEXT_NAME
source: Match result (AN)
es: Resultado de la partida (AN)

# MATCH_RESULT_DESCRIPTION
source: 0 =not finished, 1 =white wins, 2 =black wins, 3 =draw
es: 0 = no terminado, 1 = blancas ganan, 2 = negras ganan, 3 = tablas

# MATCH_RESULT_NAME
source: Match result
es: Resultado de la partida

# MENU_DATABASE
source: Database
es: Base de datos

# MENU_FILE
source: File
es: Archivo

# MENU_HELP
source: Help
es: Ayuda

# MENU_WINDOW
source: Window
es: Ventana

# MOVE_COMMENT_DESCRIPTION
source: Comment text
es: Texto del comentario

# MOVE_COMMENT_MATCH_DESCRIPTION
source: Name of the match where the comment was written
es: Nmbre de la partida en la que se ha escrito el comentario

# MOVE_COMMENT_MATCH_NAME
source: Match name
es: Nombre de la partida

# MOVE_COMMENT_NAME
source: Comment
es: Comentario

# MOVE_EVENT_DESCRIPTION
source: Move result (check, checkmate, capture, etc.)
es: Resultado del movimiento (jaque, jaque mate, captura, etc.)

# MOVE_EVENT_NAME
source: Move event
es: Evento de movimiento

# MOVE_MATCH_DESCRIPTION
source: Match where move was played out
es: Partida en la que se ha jugado el movimiento

# MOVE_MATCH_NAME
source: Move match
es: Movimiento de partida

# MOVE_TEXT_DESCRIPTION
source: Move in Algebraic Notation
es: Movimiento en notación algebraica

# MOVE_TEXT_NAME
source: Move
es: Movimiento

# MSG_CANCELCHG
source: All changes will be lost. Proceed?
es: Se perderán todos los cambios. ¿Continuar?

# MSG_COMMITCHG
source: Commit changes to the database?
es: ¿Trasladar los cambios a la base de datos?

# MSG_CONSOLIDATE
source: All the selected values will be changed to the single value '{0}'. Proceed?
es: Todos los valores seleccionados se cambiarán al valor canónico '{0}'. ¿Continuar?

# MSG_DBEXPORTED
source: Database exported
es: Base de datos exportada

# MSG_DBOPERATION
source: There is a database operation in course.
es: Hay una operación de base de datos en curso.

# MSG_DBOPERATIONQ
source: There is a database operation in course. Close anyway?
es: Hay una operación de base de datos en curso. ¿Cerrar de todo modos?

# MSG_DELETEFILE
source: Delete Source File?
es: ¿Eliminar archivo origen?

# MSG_DELMATCHES
source: All the selected matches will be utterly removed from the database. Proceed?
es: Todas las partidas seleccionadas se eliminarán por completo de la base de datos. ¿Desea continuar?

# MSG_EXPORTCOMMENTS
source: Export comments?
es: ¿Exportar comentarios?

# MSG_FILTERDELETE
source: Remove selected filter from database. Proceed?
es: El filtro seleccionado se eleiminará de la base de datos. ¿Contiunar?

# MSG_INSERTDUPLICATES
source: Insert duplicated games?
es: ¿Insertar partidas duplicadas?

# MSG_LABELMATCH
source: Matches labelled
es: Partidas etiquetadas

# MSG_MATCHDUPLICATED
source: This match already exists in the database. Save anyway?
es: Esta partida ya está en la base de datos. ¿Guardar de todos modos?

# MSG_MATCHESDEL
source: Matches deleted
es: Partidas eliminadas

# MSG_MATCHESINSERTED
source: Processed {0} matches, Inserted {1} matches, {2} duplicates found. Duplicated matches are still selected
es: Procesadas {0} partidas, Insertadas {1} partidas, {2} duplicados encontrados. Las partidas duplicadas permanecen seleccionadas.

# MSG_MATCHESINSERTED2
source: Processed {0} matches, Inserted {1} matches, {2} duplicates found.
es: Procesadas {0} partidas, Insertadas {1} partidas, {2} duplicados encontrados.

# MSG_MATCHESSAVED
source: Matches Saved
es: Partidas guardadas

# MSG_OPCANCEL
source: Operation cancelled
es: Operación cancelada

# MSG_PGNLOADED
source: PGN File Parsed
es: Archivo PGN traducido

# MSG_QRYFINISHED
source: Query finished in {0}
es: Consulta finalizada en {0}

# MSG_RESULTEXPORTED
source: {0} Results exported
es: {0} Resultados exportados

# MSG_RESULTSAVED
source: Results saved
es: Resultados guardados

# MSG_TERMINATEMATCH
source: This will finish the current match edition. This operation cannot be undone. Continue?
es: Esto finalizará la edición de la partida actual. Esta operación no se puede deshacer. ¿Continuar?

# MST_BCHECKCOUNT
source: Black check count
es: Cuenta de jaques de las negras

# MST_BDISCCHECKCOUNT
source: Black discovered check count
es: Cuenta de jaques descubiertos de las negras

# MST_BMULTICHECKCOUNT
source: Black multiple check count
es: Cuenta de jaques múltiples de las negras

# MST_TCHECKCOUNT
source: Total check count
es: Cuenta total de jaques

# MST_TDISCCHECKCOUNT
source: Total discovered check count
es: Cuenta total de jaques descubiertos

# MST_TMULTICHECKCOUNT
source: Total multiple check count
es: Cuenta total de jaques múltiples

# MST_WCHECKCOUNT
source: White check count
es: Cuenta de jaques de las blancas

# MST_WDISCCHECKCOUNT
source: White discovered check count
es: Cuenta de jaques descubiertos de las blancas

# MST_WMULTICHECKCOUNT
source: White multiple check count
es: Cuenta de jaques múltiples de las blancas

# NAG_0
source: null annotation
es: anotación nula

# NAG_1
source: good move !
es: buen movimiento !

# NAG_10
source: drawish position
es: posición de tablas

# NAG_100
source: White has good queen placement
es: Blancas tienen la dama bien posicionada

# NAG_101
source: Black has good queen placement
es: Negras tienen la dama bien posicionada

# NAG_102
source: White has poor piece coordination
es: Blancas tienen las piezas mal coordinadas

# NAG_103
source: Black has poor piece coordination
es: Negras tienen las piezas mal coordinadas

# NAG_104
source: White has good piece coordination
es: Blancas tienen las piezas bien coordinadas

# NAG_105
source: Black has good piece coordination
es: Negras tienen las piezas bien coordinadas

# NAG_106
source: White has played the opening very poorly
es: Blancas han jugado muy mal la apertura

# NAG_107
source: Black has played the opening very poorly
es: Negras han jugado muy mal la apertura

# NAG_108
source: White has played the opening poorly
es: Blancas han jugado mal la apertura

# NAG_109
source: Black has played the opening poorly
es: Negras han jugado mal la apertura

# NAG_11
source: equal chances, quiet position
es: igualados, posición tranquila

# NAG_110
source: White has played the opening well
es: Blancas han jugado bien la apertura

# NAG_111
source: Black has played the opening well
es: Negras han jugado bien la apertura

# NAG_112
source: White has played the opening very well
es: Blancas han jugado muy bien la apertura

# NAG_113
source: Black has played the opening very well
es: Negras han jugado muy bien la apertura

# NAG_114
source: White has played the middlegame very poorly
es: Blancas han jugado muy mal el medio juego

# NAG_115
source: Black has played the middlegame very poorly
es: Negras han jugado muy mal el medio juego

# NAG_116
source: White has played the middlegame poorly
es: Blancas han jugado mal el medio juego

# NAG_117
source: Black has played the middlegame poorly
es: Negras han jugado mal el medio juego

# NAG_118
source: White has played the middlegame well
es: Blancas han jugado bien el medio juego

# NAG_119
source: Black has played the middlegame well
es: Negras han jugado bien el medio juego

# NAG_12
source: equal chances, active position
es: igualados, posición activa

# NAG_120
source: White has played the middlegame very well
es: Blancas han jugado muy bien el medio juego

# NAG_121
source: Black has played the middlegame very well
es: Negras han jugado muy bien el medio juego

# NAG_122
source: White has played the ending very poorly
es: Blancas han jugado muy mal el final

# NAG_123
source: Black has played the ending very poorly
es: Negras han jugado muy mal el final

# NAG_124
source: White has played the ending poorly
es: Blancas han jugado mal el final

# NAG_125
source: Black has played the ending poorly
es: Negras han jugado mal el final

# NAG_126
source: White has played the ending well
es: Blancas han jugado bien el final

# NAG_127
source: Black has played the ending well
es: Negras han jugado bien el final

# NAG_128
source: White has played the ending very well
es: Blancas han jugado muy bien el final

# NAG_129
source: Black has played the ending very well
es: Negras han jugado muy bien el final

# NAG_13
source: unclear position
es: posición no clara

# NAG_130
source: White has slight counterplay
es: Blancas tienen un ligero contraataque

# NAG_131
source: Black has slight counterplay
es: Negras tienen un ligero contraataque

# NAG_132
source: White has moderate counterplay
es: Blancas tienen un contraataque moderado

# NAG_133
source: Black has moderate counterplay
es: Negras tienen un contraataque moderado

# NAG_134
source: White has decisive counterplay
es: Blancas tienen un contraataque decisivo

# NAG_135
source: Black has decisive counterplay
es: Negras tienen un contraataque decisivo

# NAG_136
source: White has moderate time control pressure
es: Blancas tienen una presión de tiempo moderada

# NAG_137
source: Black has moderate time control pressure
es: Negras tienen una presión de tiempo moderada

# NAG_138
source: White has severe time control pressure
es: Blancas tienen una presión de tiempo severa

# NAG_139
source: Black has severe time control pressure
es: Negras tienen una presión de tiempo severa

# NAG_14
source: White has a slight advantage
es: Blancas tienen una ligera ventaja

# NAG_15
source: Black has a slight advantage
es: Negras tienen una ligera ventaja

# NAG_16
source: White has a moderate advantage
es: Blancas tienen una ventaja moderada

# NAG_17
source: Black has a moderate advantage
es: Negras tienen una ventaja moderada

# NAG_18
source: White has a decisive advantage
es: Blancas tienen una ventaja decisiva

# NAG_19
source: Black has a decisive advantage
es: Negras tienen una ventaja decisiva

# NAG_2
source: poor move ?
es: movimiento malo ?

# NAG_20
source: White has a crushing advantage (Black should resign)
es: Blancas tienen una ventaja aplastante (Negras deberían rendirse)

# NAG_21
source: Black has a crushing advantage (White should resign)
es: Negras tienen una ventaja aplastante (Blancas deberían rendirse)

# NAG_22
source: White is in zugzwang
es: Blancas en zugzwang

# NAG_23
source: Black is in zugzwang
es: Negras en zugzwang

# NAG_24
source: White has a slight space advantage
es: Blancas tienen una ligera ventaja de espacio

# NAG_25
source: Black has a slight space advantage
es: Negras tienen una ligera ventaja de espacio

# NAG_26
source: White has a moderate space advantage
es: Blancas tienen una ventaja de espacio moderada

# NAG_27
source: Black has a moderate space advantage
es: Negras tienen una ventaja de espacio moderada

# NAG_28
source: White has a decisive space advantage
es: Blancas tienen una ventaja decisiva de espacio

# NAG_29
source: Black has a decisive space advantage
es: Negras tienen una ventaja decisiva de espacio

# NAG_3
source: very good move !!
es: muy buen movimiento !!

# NAG_30
source: White has a slight time (development) advantage
es: Blancas tienen una ligera ventaja de tiempo (desarrollo)

# NAG_31
source: Black has a slight time (development) advantage
es: Negras tienen una ligera ventaja de tiempo (desarrollo)

# NAG_32
source: White has a moderate time (development) advantage
es: Blancas tienen una ventaja moderada de tiempo (desarrollo)

# NAG_33
source: Black has a moderate time (development) advantage
es: Negras tienen una ventaja moderada de tiempo (desarrollo)

# NAG_34
source: White has a decisive time (development) advantage
es: Blancas tienen una ventaja decisiva de tiempo (desarrollo)

# NAG_35
source: Black has a decisive time (development) advantage
es: Negras tienen una ventaja decisiva de tiempo (desarrollo)

# NAG_36
source: White has the initiative
es: Blancas tienen la iniciativa

# NAG_37
source: Black has the initiative
es: Negras tienen la iniciativa

# NAG_38
source: White has a lasting initiative
es: Blancas tienen una iniciativa duradera

# NAG_39
source: Black has a lasting initiative
es: Negras tienen una iniciativa duradera

# NAG_4
source: very poor move ??
es: movimiento muy malo ??

# NAG_40
source: White has the attack
es: Blancas tienen el ataque

# NAG_41
source: Black has the attack
es: Negras tienen el ataque

# NAG_42
source: White has insufficient compensation for material deficit
es: Blancas tienen una compensación insuficiente por la pérdida de material

# NAG_43
source: Black has insufficient compensation for material deficit
es: Negras tienen una compensación insuficiente por la pérdida de material

# NAG_44
source: White has sufficient compensation for material deficit
es: Blancas tienen una compensación suficiente por la pérdida de material

# NAG_45
source: Black has sufficient compensation for material deficit
es: Negras tienen una compensación suficiente por la pérdida de material

# NAG_46
source: White has more than adequate compensation for material deficit
es: Blancas tienen una compensación más que adecuada por la pérdida de material
