Repository: mdkusz/AIChessDB
Catalog: AIChessDatabase/Properties/UIResources.*.resx
Languages: es

# COL_white_pawns
source: White Pawns
es: Peones blancos

# COL_black_rooks
source: Black Rooks
es: Torres negras

# COL_white_rooks
source: White Rooks
es: Torres blancas

# COL_black_bishops
source: Black Bishops
es: Alfiles negros

# COL_white_bishops
source: White Bishops
es: Alfiles blancos

# COL_black_knights
source: Black Knights
es: Caballos negros

# COL_white_knights
source: White Knights
es: Caballos blancos

# COL_black_queens
source: Black Queens
es: Reinas negras

# COL_white_queens
source: White Queens
es: Reinas blancas

# CAT_POSITION
source: Match Positions
es: Posiciones de la partida

# LAB_Square
source: Square
es: Escaque

# TTP_FILTERBYTAG
source: Filter by Keyword
es: Filtrar por etiquetas

# TTP_FILTERBYPOS
source: Filter by Position
es: Filtrar por posiciones

# TTP_FILTERBYMOVE
source: Filter by Move
es: Filtrar por movimientos

# MSG_UILaunched
source: The user interface forms needed to serve this call has been shown to the user.
es: Se han mostrado al usuario los formularios necesarios para servir esta llamada.

# ERR_PARAMMANDATORY
source: Those parameters are mandatory: {0}
es: Estos parámetros son obligatorios: {0}

# ERR_INVALIDPARAMVALUE
source: Invalid parameter {0} value: {1}
es: Valor no valido para el parámetro {0}: {1}

# TTL_Console
source: AI Assistants Console
es: Consola de asistentes IA

# CAP_LOADING
source: Loading data...
es: Cargando datos...

# MSG_LOADINGWHITEK
source: Loading White player autocomplete suggestions…
es: Cargando sugerencias de auto completado para jugador blancas...

# MSG_LOADINGBLACKK
source: Loading black player autocomplete suggestions...
es: Cargando sugerencias de auto completado para jugador negras...

# ERR_NOFREECONNECTIONS
source: No free connections available. Please close some open windows before requesting a new one.
es: No hay conexiones disponibles. Cierre algunas ventanas para liberar conexiones.

# ERR_NOCONNECTOR
source: Connector must be initialized before setting MaxConnections.
es: Es necesario inicializar la conexión antes de modificar el número de conexiones.

# ERR_MAXCONNEGATIVE
source: Maximum connections must be a non-negative integer.
es: El máximo de conexiones debe ser un entero no negativo.

# ERR_CONNECTIONSINUSE
source: Cannot change MaxConnections while connections are in use.
es: No es posible cambiar el máximo de conexiones con conexiones en uso.

# ERR_NOAVAILABLECONNECTIONS
source: There are no database connections available for this operation.
es: No hay conexiones de base de datos disponibles para esta operación.

# OPT_BULKCOPYDB
source: Copy Database...
es: Copiar base de datos...

# CB_NEVER
source: Never Occurs
es: Nunca ocurre

# MSG_import_pgn_file
source: Opening the import PGN files form
es: Abriendo el formulario para importar archivos PGN

# MSG_import_multiple_pgn_files
source: Opening the import multiple PGN files form
es: Abriendo el formulario para importar múltiples archivos PGN

# MSG_copy_database
source: Opening the copy database form
es: Abriendo el formulario para copiar la base de datos

# MSG_create_new_match
source: Opening the form to create a new match
es: Abriendo el formulario para crear una nueva partida

# MSG_open_new_querywindow
source: Opening a new query database form
es: Abriendo un nuevo formulario para consultar la base de datos

# MSG_normalize_match_labels
source: Opening a form to unify match label values
es: Abriendo un formulario para unificar valores de etiqueta de partida

# MSG_arrange_windows
source: Arranging open forms
es: Organizando los formularios abiertos

# MSG_list_open_automation_forms
source: Getting a list of open interactive forms
es: Obteniendo una lista de formularios interactivos abiertos

# MSG_get_form_controls
source: Getting the list of form controls...
es: Obteniendo la lista de controles del formulario...

# MSG_get_children_controls
source: Getting the children controls list of the control...
es: Obteniendo la lista de controles hijos del control....

# MSG_highlight_control
source: Highlighting control...
es: Resaltando control...

# MSG_comment_control
source: Commenting on the control...
es: Comentando sobre el control...

# MSG_get_open_match_windows
source: Getting a list of open chess player forms...
es: Obteniendo una lista de formularios para visualizar y jugar partidas...

# MSG_get_current_match_info
source: Getting the current match info...
es: Obteniendo información sobre la partida actual...

# MSG_get_current_match_moves
source: Getting the current match move list...
es: Obteniendo la lista de movimientos de la partida actual...

# MSG_get_last_match_move
source: Getting the current match last move...
es: Obteniendo el último movimiento de la partida actual...

# MSG_go_to_next_match_move
source: Moving to the current match next move...
es: Avanzando al siguiente movimiento de la partida actual...

# MSG_go_to_previous_match_move
source: Moving to the current match previous move...
es: Retrocediendo al movimiento anterior de la partida actual...

# MSG_add_new_match_move
source: Making a new move in the current match...
es: Realizando un nuevo movimiento en la partida actual...

# ERR_NOTEDITABLEMATCH
source: This match is not currently editable
es: Esta partida no se puede editar en este momento.

# TTL_APPCONFIGURATION
source: Application Settings
es: Parámetros de configuración

# BTTL_DBConnection
source: Database Connection
es: Conexión con la base de datos

# BTTL_Paths
source: File Paths
es: Rutas a archivos

# BTTL_Files
source: File Names
es: Nombres de archivo

# FILTER_LogFiles
source: Log files (*.log)|*.log
es: Archivos de Log (*.log)|*.log

# FILTER_AllFiles
source: All Files (*.*)|*.*
es: Todos los archivos (*.*)|*.*

# FILTER_Json
source: Json Files (*.json)|*.json
es: Archivos Json (*.json)|*.json

# BTTL_DefValues
source: Default Values
es: Valores por defecto

# BTTL_CredentialMgr
source: Credential Manager
es: Administrador de credenciales

# NAME_dbconstring
source: Connection String
es: Cadena de conexión

# DESC_dbconstring
source: Select a connection string name to connect the database server
es: Selecciona un nombre de cadena de conexión para conectar con el servidor de base de datos

# NAME_dbconnections
source: Max Connections
es: Máximo Conexiones

# DESC_dbconnections
source: Number of connections to the database that can be open at once
es: Número de conexiones con la base de datos que pueden estar abiertas al mismo tiempo

# NAME_dataPath
source: Data Path
es: Directorio de datos

# DESC_dataPath
source: Directory to store documents and temporary data
es: Directorio para almacenar documentos y datos temporales

# NAME_ConfigPath
source: Configuration Path
es: Directorio de configuración

# DESC_ConfigPath
source: Directory path where the application configuration files are storerd
es: Ruta del directorio en el que se guardan los archivos de configuración

# NAME_playCollection
source: Play Collection
es: Colección de asistentes

# DESC_playCollection
source: Name of the file that defines teams of assistants (Players) working together in a console (Play).
es: Nombre del archivo que en el que se definen equipos de asistentes (Players) que trabajan juntos en la consola (Play)

# NAME_appFunctions
source: Function Collection
es: Colección de funciones

# DESC_appFunctions
source: Name of the file with all the function schemas used by the assistants to interact with the application
es: Nombre del archivo con los esquemas de definición de funciones usadas por los asistentes para interactuar con la aplicación

# NAME_nsQueries
source: Non-Standard Queries
es: Consultas no estándar

# DESC_nsQueries
source: Name of the file that contains database queries using non-ISO SQL
es: Nombre del archivo con consultas de base de datos que usan SQL no ISO

# NAME_defaultPlay
source: Default Play
es: Equipo por defecto

# DESC_defaultPlay
source: Name of the default play in the play collection to use when the application opens
es: Nombre de la play por defecto que se utilizará al abrir la aplicación

# NAME_ConsoleLog
source: Console Log File
es: Archivo de log de consola

# DESC_ConsoleLog
source: Name of the file to store the log messages of the assistants console
es: Nombre del archivo para guardar los mensajes de log de la consola de asistentes

# NAME_LogPathBase
source: Log Files Path
es: Directorio de archivos de log

# DESC_LogPathBase
source: Directory path to store all the log files generated by the application
es: Directorio para almacenar todos los archivos de log generados por la aplicación

# NAME_FunctionCallLog
source: Function Calls Log
es: Log de llamadas a función

# DESC_FunctionCallLog
source: Name of the file with the log messages of function calls and results
es: Nombre del archivo con mensajes de log de llamadas a función y sus resultados

# NAME_tokenUsageLog
source: Token Usage Log
es: Log de uso de tokens

# DESC_tokenUsageLog
source: Name of the file with information on the number of tokens used by AI models
es: Nombre del archivo donde se almacena la información de tokens usados por los modelos IA

# NAME_CredentialStore
source: Credential Store
es: Almacén de credenciales

# DESC_CredentialStore
source: Select the credential store manager used to store credentials for API and database connections
es: Seleccionar el almacén de credenciales usado para almacenar las contraseñas de acceso a API y bases de datos

# NAME_CredentialStoreKeyData
source: Credential Store Extra Data
es: Datos extra para el almacén de credenciales

# DESC_CredentialStoreKeyData
source: Semi-colon separated data to append to the credential name to retrieve a key from the credential store.
es: Datos separados por punto y coma para añadir al nombre de la credencial para recuperar la clave desde el almacén de credenciales. Normalmente vacío.

# MSG_show_application_configuration
source: Opening a dialog box to change the application settings
es: Abriendo un cuadro de diálogo para cambiar los parámetros de la aplicación

# TTL_Play
source: Play Editor
es: Editor de Equipos

# TTP_DelPlay
source: Delete Selected Play
es: Eliminar teatro seleccionado

# TTP_EditPlay
source: Create or Edit Play
es: Crear o editar equipo

# TTP_Font
source: Change Font
es: Cambiar fuente

# TTP_LoadPlay
source: Edit Selected Play
es: Editar teatro seleccionado

# TTP_AddItem
source: Add New Item to the Node
es: Añadir nuevo elemento al nodo

# TTP_RemoveItem
source: Remove Item from Node
es: Eliminar el elemento del nodo

# TTP_SaveConfiguration
source: Save Configuration
es: Guardar configuración

# LAB_Plays
source: Plays
es: Equipos

# LAB_AddItem
source: Add
es: Añadir

# MSG_DeleteObject
source: Warning: This action will permanently delete the object and it cannot be recovered. Are you sure you want to proceed?
es: Aviso! El objeto será eliminado y no se podrá recuperar. ¿Está seguro de querer eliminarlo?

# CAP_DelObject
source: Object Deletion
es: Borrado de objeto

# MSG_show_play_editor
source: Opening the form to edit Plays...
es: Abriendo el formulario para editar Equipos de asistentes

# MSG_MoveFiles
source: Move files to the new location?
es: ¿Mover los archivos a la nueva ubicación?

# MSG_CopyFile
source: Copy the file to the proper directory?
es: ¿Copiar el archivo al directorio apropiado?

# MSG_add_new_note
source: Writing the note to the player notes document...
es: Escribiendo la nota en el documento de notas del asistente...

# MSG_add_new_note2
source: Updating notes in the assistant document store...
es: Actualizando las notas en el almacén de documentos del asistente...

# MSG_rewrite_all_notes
source: Rewriting all the assistant notes document...
es: Reescribiendo todo el contenido del documento de notas del asistente...

# TTL_Assistants
source: AI Elements Editor
es: Editor de elementos IA

# TTP_NewItem
source: Create new instance of the selected element type
es: Crear una nueva instancia del tipo de elemento seleccionado

# TTP_DeleteElement
source: Delete the selected element instance
es: Eliminar la instancia de elemento seleccionada

# TTP_SaveChanges
source: Save changes to the provider cloud and configuration files
es: Guardar los cambios en la nube del proveedor y en los archivos de configuración.

# MSG_show_assistants_editor
source: Opening the assistants editor form...
es: Abriendo el formulario de edición de asistentes

# SRV_userinterface
source: User interface assistant
es: Asistente de interfaz de usuario

# SRV_automation
source: Explain and manage form controls
es: Explica y maneja controles de formulario

# SRV_chessplayer
source: Play and analyze chess games
es: Juega y analiza partidas de ajedrez

# SRV_configuration
source: Configuration assistant
es: Asistente de configuración

# SRV_memoryandnotes
source: Read and write notes with relevant information
es: Lee y escribe notas con información relevante

# NAME_FIlePackageManagerData_Identifier
source: Unique Identifier
es: Identificador único

# DESC_FIlePackageManagerData_Identifier
source: File package manager unique identifier
es: Identificador único del paquete de archivos

# NAME_FIlePackageManagerData_Name
source: File Package Name
es: Nombre del paquete

# DESC_FIlePackageManagerData_Name
source: File package manager name
es: Nombre del administrador de paquete de archivos

# NAME_FIlePackageManagerData_Description
source: File Package Description
es: Descripción del paquete

# DESC_FIlePackageManagerData_Description
source: File package manager description
es: Descripción del administrador de paquete de archivos

# BTTL_PackageManager
source: File Package Manager
es: Gestor de paquetes de archivos

# NAME_FIleManager
source: File Manager
es: Gestor de archivos

# BTTL_FileManager
source: File Manager
es: Gestor de archivos

# NAME_FileManagerData_FilePaths
source: Data Files
es: Archivos de datos

# DESC_FileManagerData_FilePaths
source: Data files in the data directory
es: Archivos de datos en el directorio de datos

# FIL_ALLAllowed
source: All Allowed Files
es: Todos los archivos permitidos

# CMD_UploadFiles
source: Upload Files
es: Subir archivos

# NAME_FIlePackageManagerData_FileManager
source: File Manager
es: Gestor de archivos

# DESC_FIlePackageManagerData_FileManager
source: Use this instance of file manager to upload files that can be added to the file package
es: Usa esta instancia de gestor de archivos para subir archivos que se pueden añadir al paquete de archivos

# CMD_ManageFiles
source: Manage Files
es: Gestionar archivos

# NAME_SpeechManagerData_Identifier
source: Identifier
es: Identificador

# DESC_SpeechManagerData_Identifier
source: Unique identifier for this speech manager object
es: Identificador único para este objeto gestor de voz

# NAME_SpeechManagerData_Name
source: Name
es: Nombre

# DESC_SpeechManagerData_Name
source: Name of the speech manager
es: Nombre del gestor de voz

# NAME_SpeechManagerData_Description
source: Description
es: Descripción

# DESC_SpeechManagerData_Description
source: Speech manager description
es: Descripción del gestor de voz

# DESC_SpeechManagerData_Model
source: Model used to manage speech and/or transcription
es: Modelo usado para gestionar la voz o la transcripción de voz

# NAME_SpeechManagerData_Model
source: Model
es: Modelo

# BTTL_SpeechManager
source: Speech Manager
es: Gestor de voz

# NAME_APIPlayerData_Identifier
source: Unique Identifier
es: Identificador único

# DESC_APIPlayerData_Identifier
source: API assistant unique identifier
es: Identificador único del asistente API

# NAME_APIPlayerData_Name
source: Name
es: Nombre

# DESC_APIPlayerData_Name
source: API assistant name
es: Nombre del asistente API

# NAME_APIPlayerData_Description
source: Description
es: Descripción

# DESC_APIPlayerData_Description
source: API assistant description
es: Descripción del asistente API

# NAME_APIPlayerData_Instructions
source: Initial Instructions
es: Instrucciones iniciales

# DESC_APIPlayerData_Instructions
source: Initial (system) instructions for this assistant. Only for assistants stored in the provider cloud.
es: Instrucciones iniciales (system) para este asistente

# NAME_APIPlayerData_Model
source: Model
es: Modelo

# DESC_APIPlayerData_Model
source: LLM model used by this assistant
es: Modelo LLM usado por este asistente. Solo para asistentes guardados en la nube del proveedor.

# NAME_APIPlayerData_Voice
source: Voice Name
es: Nombre de voz

# DESC_APIPlayerData_Voice
source: Name of the voice used by this assistant to speak. Voice names are provided by speech manager objects
es: Nombre de la voz que usa este asistente para hablar. Los nombres de las voces los proporcionan los asistentes de voz

# BTTL_APIPlayer
source: API Assistant
es: Asistente API

# NAME_APIPlayerData_WebSearch
source: Search the Web
es: Búsqueda en la Web

# DESC_APIPlayerData_WebSearch
source: Activate the assistant's capability to searcg the web
es: Activar la capacidad del asistente para búsqueda en internet

# MSG_DeleteObjectFromCfgFiles
source: This action removes the item from the application’s configuration files only. It will not delete anything from your AI provider. Proceed?
es: Esta acción eliminará el item de los archivos de configuración de la aplicación. No se borrará nada en la nube del proveedor de IA. ¿Desea continuar?

# MSG_ChangesNotSaved
source: You have non-saved changes. They will be lost if you close the form. Proceed anyway?
es: Tienes cambios sin guardar. Se perderán si cierras el formulario. ¿Quieres continuar?

# TTL_AssistantUpdates
source: Assistant documents updates
es: Actualizaciones de documentos de los asistentes

# LAB_Instance
source: Instance
es: Instancia

# LAB_OtherInstances
source: Other Instances
es: Otras Instancias

# MSG_show_updates_editor
source: Opening the updates editor form...
es: Abriendo el formulario editor de actualizaciones...

# NAME_UpdateAssistantsConfiguration_Assistants
source: Assistant Updates
es: Actualizaciones de asistente

# DESC_UpdateAssistantsConfiguration_Assistants
source: Updates for initial instructions and assistant's private documents
es: Actualizaciones de instrucciones iniciales y documentos privados del asistente

# NAME_UpdateAssistantsConfiguration_Services
source: Service Updates
es: Actualizaciones de servicio

# DESC_UpdateAssistantsConfiguration_Services
source: Updates for the service documents
es: Actualizaciones de los documentos de servicio

# NAME_AssistantUpdates_UpdateInstructions
source: Update Instructions
es: Actualizar instrucciones

# DESC_AssistantUpdates_UpdateInstructions
source: Check to update the assistant initial instructions
es: Marcar para actualizar las instrucciones iniciales del asistente

# NAME_AssistantUpdates_Documents
source: Documents
es: Documentos

# DESC_AssistantUpdates_Documents
source: Assistant private documents list
es: Lista de documentos privados del asistente

# NAME_ServiceUpdates_ServiceId
source: Service Identifier
es: Identificador del servicio

# DESC_ServiceUpdates_ServiceId
source: Unique identifier for the service
es: Identificador único del servicio

# DESC_ServiceUpdates_Documents
source: Service documents list
es: Lista de documentos del servicio

# NAME_ServiceUpdates_Documents
source: Documents
es: Documentos

# NAME_ApplicationDocument_Update
source: Update Document
es: Actualizar documento

# DESC_ApplicationDocument_Update
source: Chect to upload the document to the provider cloud file storage
es: Marcar para subir el documento al almacén de archivos en la nube del proveedor

# NAME_ApplicationDocument_Remove
source: Remove Document
es: Eliminar documento

# DESC_ApplicationDocument_Remove
source: Chect to remove the document from the provider cloud file storage
es: Marcar para eliminar el documento del almacén de archivos en la nube del proveedor

# NAME_ApplicationDocument_FileName
source: File Name
es: Nombre del archivo

# DESC_ApplicationDocument_FileName
source: File name. This document must be placed in the application data directory.
es: Nombre del archivo. Este documento debe ubicarse en el directorio de datos de la aplicación.

# BTTL_Document
source: Document
es: Documento

# OPT_CONFIGAPP
source: Edit Configuration Settings...
es: Editar parámetros de configuración...

# OPT_CONFIGPLAY
source: Edit Play Configuration...
es: Editar configuración de equipos...

# OPT_CONFIGASSISTANTS
source: Edit Assistants Configuration...
es: Editar configuración de asistentes...

# OPT_CONFIGAUPDATES
source: Edit Updates Configuration...
es: Editar configuración de actualizaciones...

# TTP_EditDocument
source: Edit the selected document
es: Editar el documento seleccionado

# TTP_AddDocuments
source: Add documents to the selected list
es: Añadir documentos a la lista seleccionada

# TTP_ApplyUpdates
source: Apply updates to all the documents and assistant instructions
es: Aplicar las actualizaciones a todos los documentos e instrucciones de asistente

# NAME_updateConfiguration
source: Assistant Updates File
es: Archivo de actualización de asistentes

# DESC_updateConfiguration
source: Update assistants documents and instructions file name
es: Nombre de l archivo de actualización de documentos e instrucciones de los asistentes

# FILTER_Text
source: Text Files (*.txt)|*.txt
es: Archivos de texto (*.txt)|*.txt

# MSG_AllUpdated
source: All marked documents and instructions has been updated
es: Se han actualizado todos los documentos e instrucciones marcados.

# NAME_PGNFormatter
source: Export to PGN file
es: Exportar a archivo PGN

# FIL_PGNFiles
source: PGN Files (*.pgn)|*.pgn|All Files (*.*)|*.*
es: Archivos PGN (*.pgn)|*.pgn|Todos los archivos (*.*)|*.*

# NAME_MatchFormatter
source: Export to a database
es: Exportar a una base de datos

# NAME_MatchDataImportManager
source: Match Data Import Manager
es: Gestor de importación de partidas

# DESCRIPTION_MatchDataImportManager
source: Import Match objects from a DataTable with a field named cod_match
es: Importa objetos de partida desde una DataTable con un campo llamado cod_match

# ERR_NODATABASESELECTED
source: No target database selected
es: No se ha seleccionado una base de datos de destino

# ERR_BADREPOSITORYTYPE
source: Repository must be able to handle ObjectBase objects.
es: El repositorio debe poder gestionar objetos de tipo ObjectBase.

# FNAME_AIAssistantsEditor
source: AI assistants editor
es: Editor de asistentes IA

# FNAME_BulkIMportPGN
source: Massive PGN files import
es: Importación masiva de archivos PGN

# FNAME_DlgMatch
source: Match Dialog Box
es: Cuadro de diálogo de partida

# FNAME_MatchEditor
source: Match Editor
es: Editor de partidas

# FNAME_PGNWindow
source: Import PGN files and play the contained matches
es: Importar archivos PGN y visualizar las partidas que contienen

# FNAME_PLayMatchWindow
source: Play Match Window
es: Ventana de juego de partidas

# FNAME_QueryWindow
source: Query Database Form
es: Formulario de consultas en la base de datos

# TTL_Credits
source: Credits
es: Créditos

# TTP_AddPlay
source: Add new play
es: Añadir nuevo equipo

# NAME_NewPlay
source: New Play {0}
es: Nuevo equipo {0}

# ERR_PlayIdInUse
source: Play identifier in use
es: Identificador de equipo en uso

# MSG_ConfigurationSaved
source: Configuration succesfully saved
es: Configuración guardada con éxito

# CAP_Information
source: Information
es: Información

# TTP_SetAsDefaultPlay
source: Set this play the default one
es: Establecer este equipo como el equipo por defecto

# TTP_ChangeToPlay
source: Make this play the current one. Conversation context will be lost.
es: Establecer este equipo como el equipo activo. Se perderá el contexto de la conversación.

# MSG_LoadingPlay
source: Loading Play...
es: Cargando equipo...

# MSG_LoadingPGN
source: Loading PGN File...
es: Cargando archivo PGN...
