Repository: mdkusz/AIChessDB
Catalog: AIChessDatabase/Properties/UIResources.*.resx
Languages: es

# MSG_StartConfiguration
source: This application must be configured before using it. You will be asked for some parameter values.
es: Esta aplicación debe configurarse antes de usarla. Se le solicitarán algunos valores de parámetros.

# ERR_AppNotProperlyConfigured
source: The application is not properly configured. Exiting.
es: La aplicación no está configurada correctamente. Saliendo.

# SETUP_CredentialStore
source: The credential store is used to securely store passwords. In this application, three basic stores are available: - Windows Credential Store: credentials are saved for the current user in the Generic Credentials section. You can access this store from the Control Panel. - Environment variables: credentials are stored in a user-level environment variable. - Application configuration file: credentials will be stored in the AppSettings section of AIChessDB.exe.config. Anyone with access to this file will be able to see them. In any case, you will have to enter a name for the credential. You will be asked to create a credential for the OpenAI API key. You will also be asked to create credentials for the database connection strings, since they contain passwords and access data.
es: El almacén de credenciales se utiliza para almacenar contraseñas de manera segura. En esta aplicación, están disponibles tres almacenes básicos: - Almacén de credenciales de Windows: se guardan las credenciales para el usuario actual en la sección de credenciales genéricas. Puedes acceder a este almacén desde el panel de control. - Variables de entorno: las credenciales se almacenan en una variable de entorno del usuario actual. - Fichero de configuración de la aplicación: las credenciales se guardarán en la sección AppSettings del archivo AIChessDB.exe.config. Cualquiera que tenga acceso a este archivo podrá ver las credenciales. En cualquiera de los casos, tendrás que introducir un nombre para la credencial. Se solicitará crear una credencial para la clave de API de OpenAI. También se solicitará crear credenciales para las cadenas de conexión con la base de datos, ya que contienen contraseñas y datos de acceso.

# CAP_Instructions
source: Instructions
es: Instrucciones

# BTTL_APIKey
source: OpenAI API Key
es: Clave API OpenAI

# NAME_APIManagerName
source: API Name
es: Nombre de API

# DESC_APIManagerName
source: AI API account provider name
es: Nombre de la cuenta de proveedor de API IA

# NAME_APIKeyName
source: API key name
es: Nombre de la clave API

# DESC_APIKeyName
source: Name to store the API key in the credential store manager
es: Nombre para almacenar la clave en el almacén de credenciales

# NAME_APIKeyValue
source: API Key
es: Clave API

# DESC_APIKeyValue
source: API key actual value to store in the credential store
es: Valore real de la clave de API para almacenar en el almacén de credenciales

# SETUP_APIKey
source: AI assistants work through an API manager. Each API manager requires a key to operate. Enter an identifying name for the key and its actual value, provided by the API provider. In the configuration files, only the key name will be stored. The actual key will be saved in the credential manager selected in the previous step.
es: Los asistentes IA funcionan a través de un administrador de API. Cada administrador de API necesita de una clave para operar. Introduce un nombre identificativo para la clave y su valor real, suministrado por el proveedor de API. En los archivos de configuración se almacenará el nombre de la clave. La clave real se guardará en el administrador de credenciales seleccionado en el paso anterior.

# SETUP_ConnectionString
source: This application works with a database. Before continuing with the setup, you must ensure that the database is installed and accessible from this computer. The database can be hosted on an Oracle, SQL Server, or MySQL server. To connect, you need to create at least one connection string, although several can be created for the same server or for different servers. Connection strings always require the following data: - Server name or IP address (and port, if not using the default one). - Username to access the database. - User password. In MySQL and SQL Server, you must also specify the database or schema where the data resides.
es: Esta aplicación funciona con una base de datos. Antes de continuar con la configuración, debes asegurarte de que la base de datos está instalada y es accesible desde este ordenador. La base de datos se pueden montar sobre un servidor Oracle, SQL Server o MySQL. Para conectar es necesario crear al menos una cadena de conexión, aunque se pueden crear varias para el mismo servidor o para servidores diferentes. Las cadenas de conexión necesitan obligatoriamente estos datos: - Nombre o dirección IP (y puerto, si no se usa el estándar) del servidor de base de datos. - Nombre del usuario que accede a la base de datos. - Contraseña del usuario. En MySQL y Sql Server también es necesario indicar el nombre de la base de datos o esquema en el que residen los datos.

# ERR_CompleteAllFields
source: Some required fields are missing.
es: Faltan algunos campos obligatorios

# DESC_dbconstringname
source: Connection string name to store in the configuration file
es: Nombre de la cadena de conexión para guardar en el archivo de configuración

# NAME_dbconstringname
source: Connection String Name
es: Nombre de la conexión

# DESC_connstring
source: Connection string for the database server
es: Cadena de conexión para el servidor de base de datos

# NAME_dbconnector
source: Database Connector
es: Conector con la base de datos

# DESC_dbconnector
source: Select a database connector to build a suitable connection string
es: Seleccione un conector de base de datos para configurar una cadena de conexión apropiada

# ERR_NoConsoleFound
source: No assistants console found
es: No se ha encontrado ninguna consola de asistentes

# BTTL_Assistants
source: AI Assistants Setup
es: Configuración de asistentes IA

# BTTL_PLayPlayer
source: PLay Player
es: Asistente del equipo

# DESC_PlayerBackColor
source: Player bubble header background color
es: Color de fondo de la barra de encabezado de la viñeta de chat del asistente

# DESC_PlayerForeColor
source: User or application bubble header text color
es: Color del texto de la barra de encabezado de la viñeta de chat del usuario o la aplicación

# DESC_PlayerType
source: Generic player type name
es: Nombre genérico del tipo de asistente

# NAME_PlayerBackColor
source: Background Color
es: Color de fondo

# NAME_PlayerForeColor
source: Foreground Color
es: Color de texto

# NAME_PlayerType
source: Player Type
es: Tipo de asistente

# NAME_PlayerName
source: Player Name
es: Nombre del asistente

# DESC_PlayerName
source: Player name to show in the assistants console
es: Nombre del asistente para mostrar en la consola de asistentes

# NAME_APIManager
source: API Manager
es: Gestor de API

# DESC_APIManager
source: Manages the AI assistant's creation and configuration
es: Gestiona la creación y configuración de asistentes IA

# NAME_ChessMate
source: Application Assistant
es: Asistente de aplicación

# DESC_ChessMate
source: Help user to understand and learn how to work with this application
es: Ayuda al usuario a entender y aprender cómo usar esta aplicación.

# NAME_Caspov
source: Chess Expert
es: Experto en ajedrez

# DESC_Caspov
source: Play games with the user and comment on matches
es: Juega al ajedrez con el usuario y comenta las partidas

# NAME_MorFix
source: Configuration Assistant
es: Asistente de configuración

# DESC_MorFix
source: Assist users with the application configuration
es: Ayuda al usuario con la configuración de la aplicación

# NAME_VectorStore
source: {0} Vector Store
es: Vector Store de {0}

# MSG_CreateingAssistants
source: Creating AI Assistants and Tools...
es: Creando los asistentes IA y sus herramientas...

# AFILE_Application
source: AIChessDB_application.txt
es: AIChessDB_aplicacion.txt

# AFILE_Automation
source: AIChessDB_automation.txt
es: AIChessDB_automatizacion.txt

# AFILE_Configuration
source: AIChessDB_configuration.txt
es: AIChessDB_configuracion.txt

# AFILE_database
source: database.txt
es: base_de_datos.txt

# IFILE_Assistant
source: {0}_instructions.txt
es: {0}_instrucciones.txt

# SETUP_Assistants
source: This is an application assisted by AI agents. By default, three assistants must be created with different functions: - Help the user with the use of the application. - Help the user with configuration. - Play chess with the user and comment on and analyze existing games. Depending on the type of assistant you select, objects will be created in the account of the chosen AI provider. A document store will also be created for each of these assistants, where the initial documentation will be stored. You can change the names, the documentation, and add new assistants once the application is configured.
es: Esta es una aplicación asistida por agentes IA. Por defecto, se deben crear tres asistentes con diversas funciones: - Ayuda al usuario con el uso de la aplicación. - Ayuda al usuario con la configuración. - Jugar con el usuario al ajedrez y comentar y analizar las partidas existentes. Dependiendo del tipo de asistente que selecciones, se crearán objetos en la cuenta del proveedor de IA seleccionado. También se creará un almacén de documentos para cada uno de estos asistentes, en el que se guardará la documentación inicial. Puedes cambiar los nombres, la documentación, y añadir nuevos asistentes una vez configurada la aplicación.

# MSG_CreatingAssistant
source: Creating {0} Configuration...
es: Creando la configuración de {0}...

# MSG_UploadingDocuments
source: Uploading Documents to Stores...
es: Subiendo documentos...

# ERR_UploadingDocuments
source: Errors Uploading Documents
es: Errores subiendo documentos

# NAME_DefPlay
source: AIChessDB Default Cast
es: Equipo por defecto AIChessDB

# DESC_DefPlay
source: AIChessDB AI assistants configuration
es: Configuración de asistentes IA de AIChessDB

# URL_STL
source: https://software-tecnico-libre.es/en/stl-index
es: https://software-tecnico-libre.es/es/indice-stl

# MSG_SystemToUser
source: ### Welcome to AIChessDB This application combines **a chess games database** with **AI assistants** that guide you through its use. From the console, you can ask the assistants to help you with: - **Importing games in PGN format** into the database. - **Searching existing games** with filters by players, positions, or moves. - **Creating or editing a game** manually. - **Replaying games** on an interactive board with moves and comments. You can also ask them to **explain and point out the buttons and elements of the forms**, so you can better understand how each part of the application works. In addition, the console toolbar includes a dropdown menu with quick access to the main forms. By default, there are those three assistants: - **{0}**: Help the user with the use of the application. - **{1}**: Help the user with configuration. - **{2}**: Play chess with the user and comment on and analyze existing games. Type your first request in the console, for example: **"Import a PGN file"** or **"Open the game search form"**, and let the assistants do the rest.
es: ### Bienvenido a AIChessDB Esta aplicación combina **una base de datos de partidas de ajedrez** con **asistentes IA** que te guían en su uso. Desde la consola puedes pedir a los asistentes que te ayuden a: - **Importar partidas en formato PGN** para guardarlas en la base de datos. - **Consultar partidas existentes** con filtros por jugadores, posiciones o movimientos. - **Crear o editar una partida** de forma manual. - **Reproducir partidas** en un tablero interactivo con movimientos y comentarios. También puedes pedirles que te **expliquen y señalen los botones y elementos de los formularios**, para que entiendas mejor cómo funciona cada parte de la aplicación. Además, en la barra de herramientas de la consola encontrarás un menú desplegable con accesos rápidos a los formularios principales. Por defecto, existen estos tres asistentes: - **{0}**: Ayuda al usuario con el uso de la aplicación. - **{1}**: Ayuda al usuario con la configuración. - **{2}**: Juega con el usuario al ajedrez y comenta y analiza las partidas existentes. Escribe tu primera petición en la consola, por ejemplo: **"Importar un archivo PGN"** o **"Abrir el formulario de consulta de partidas"**, y deja que los asistentes hagan el resto.

# NAME_UserName
source: User Name
es: Nombre de usuario

# DESC_UserName
source: Nickname for the assistants to address to the user
es: Apodo con el que los asistentes se dirigirán al usuario

# TTL_AIChessDB
source: AI Assisted Chess Database
es: Base de datos de ajedrez asistida por IA

# MSG_OPerationCancelled
source: Operation cancelled by the user
es: Operación cancelada por el usuario

# MSG_ControlsUploaded
source: The file {0} with the {1} form controls list has been uploaded to your documents. Read this document instead of calling list_open_automation_forms
es: El archivo {0} con la lista de controles del formulario {1} se ha añadido a tus documentos. Lee el documento en lugar de llamar a list_open_automation_forms

# TTL_EditPlayer
source: Edit {0} Configuration
es: Editar configuración de {0}

# DESC_PlayerTemperature
source: Higher values like 0.8 will make the output more random, while lower values like 0.2 will make it more focused and deterministic.
es: Valores más altos, como 0,8, harán que la salida sea más aleatoria, mientras que valores más bajos, como 0,2, la harán más centrada y determinista.

# DESC_PlayerTopP
source: The model considers the results of the tokens with top_p probability mass. So 0.1 means only tokens comprising the top 10% probability mass.
es: El modelo considera los resultados de los tokens con una masa de probabilidad superior a p. Por lo tanto, 0,1 significa solo los tokens que comprenden el 10 % superior de masa de probabilidad.

# OPT_NEWCONNSTRING
source: Create New Database Connection String...
es: Crear una nueva cadena de conexión con base de datos...

# LAB_MATCHINT
source: {0} Matches {1} Integrated {2} wrong in {3}
es: {0} Partidas {1} Integradas {2} erróneos en {3}

# LAB_BULKFILESPROC
source: {0} from {1} Processed in {2}
es: {0} de {1} Procesadas en {2}

# LAB_BULKMATCHESINT
source: {0} from {1} Inserted in {2} - {3} with errors
es: {0} de {1} Insertados en {2} - {3} con errores

# MSG_LoadingData
source: Loading Data...
es: Cargando datos...

# MSG_CountingMatches
source: Counting Total Matches...
es: Contando total de partidas...

# FIL_TXT
source: Text Files (*.txt)|*.txt|All Files (*.*)|*.*
es: Archivos de texto (*.txt)|*.txt|Todos los archivos (*.*)|*.*

# LAB_BADMOVE1
source: Pawn capture without 'x' notation
es: Captura de peón sin la notación 'x'

# LAB_BADMOVE2
source: Bad initial move format
es: Formato de inicio de movimiento incorrecto

# LAB_BADMOVE3
source: No piece in destination square to capture
es: No hay ninguna pieza en el escaque de captura

# LAB_BADMOVE4
source: Move not possible or capture not indicated
es: Movimiento imposible o captura no indicada

# LAB_BADMOVE5
source: This move puts own king on check
es: Este movimiento deja al rey propio en jaque

# LAB_BADMOVE6
source: Ambiguous move, more than one piece can be moved
es: Movimiento ambiguo, es posible mover más de una pieza

# LAB_BADMOVE7
source: Destination square not indicated
es: No se ha indicado escaque de destino

# LAB_BADMOVE8
source: Invalid piece to promote pawn to
es: Pieza no válida para promover peón.

# LAB_BADMOVE9
source: Only pawns can be promoted
es: Solo es posible promover peones

# LAB_BADMOVE10
source: No actual check
es: La jugada no es jaque

# LAB_BADMOVE11
source: No actual checkmate
es: La jugada no es mate

# LAB_BADMOVE12
source: Check without check notation (strict mode)
es: Jaque sin notación de jaque (modo estricto)

# MSG_send_complete_pgn_match
source: Processing PGN match sent...
es: Procesando la partida PGN enviada...

# MSG_MATCHESADDED
source: {0} matches added
es: {0} partidas añadidas

# MSG_MATCHADDED
source: Match added
es: Partida añadida

# ERR_NOMATCHADDED
source: No match added
es: No se ha añadido ninguna partida

# ERR_NOTIMPLEMENTED
source: Not implemented for this Form
es: No implementado para este formulario

# TTP_ADDCOMMENTS
source: Automatically add assistant commentos to the move
es: Añadir de forma automática los comentarios de los asistentes al movimiento

# NAME_PGNPath
source: PGN Default Path
es: Directorio PGN por defecto

# DESC_PGNPath
source: Default directory to store PGN files
es: Directorio por defecto para almacenar archivos PGN

# MSG_DELETINGMATCHES
source: Deleting {0} matches...
es: Borrando {0} partidas...

# ERR_INVALIDBOARDCHAR
source: Invalid board char {0}
es: Caracter de tablero no válido {0}

# ERR_MATCHNOTFOUND
source: Match {0} not found
es: No se ha encontrado la partida {0}

# ERR_MATCHWITHOUTMOVES
source: Match {0} without moves
es: La partida {0} no tiene movimientos

# ERR_MATCHWITHOUTPOS
source: Match {0} without positions
es: La partida {0} no tiene posiciones

# MSG_NODATARETURNED
source: No data returned
es: No se han devuelto datos

# NAME_PlayerParallelCalls
source: Parallel Tool Calls
es: Uso de herramientas en paralelo

# DESC_PlayerParallelCalls
source: Allow assistant to make multiple tool calls (like functions) or just one by request. Uncheck to set default behavior.
es: Permitir que el asistente realice varias llamadas a herramientas (como funciones) o solo una por solicitud. Desmarque esta opción para establecer el comportamiento predeterminado.

# MSG_SavingAIObjects
source: Saving and uploading...
es: Guardando y subiendo...

# ERR_InvalidMultipleOperation
source: Invalid operation for multiple editors
es: Operación no válida para múltiples editores

# MSG_LoadingInstances
source: Loading instances...
es: Cargando instancias...

# MSG_ChangesNotSaved2
source: There are non-saved changes. If you change to other play, they will be lost. Proceed?
es: Existen cambios sin guardar, si seleccionas otro equipo, se perderán. ¿Quieres continuar?

# SRV_querydatabase
source: Perform database queries
es: Realiza consultas en la base de datos

# MSG_list_open_query_forms
source: Getting a list of open query windows
es: Obteniendo una lista de formularios de consulta...

# MSG_set_query_view
source: Changing query view...
es: Cambiando la vista de consulta...

# ERR_UNKNOWNVIEWNAME
source: Unknown view name {0}
es: Nombre de vista desconocido {0}

# MSG_add_filter_expression
source: Adding filter '{0}'...
es: Añadiendo filtro '{0}'...

# MSG_get_current_filters
source: Getting current query filters...
es: Obteniendo los filtros actuales de la aconsulta...

# MSG_remove_filter_expressions
source: Removing filter expressions...
es: Eliminando expresiones de filtro...

# MSG_refresh_query_data
source: Refreshing grid data...
es: Refrescando los datos del listado...

# NAME_PlayerWebSearch
source: Web Search Tool
es: Búsqueda en Web

# DESC_PlayerWebSearch
source: Allow or disallow use of web search tool
es: Activar o desactivar el uso de la herramienta de búsqueda en la web

# NAME_UpdateAssistantsConfiguration_CleanExpressions
source: File clean patterns
es: Patrones de limpieza de archivos

# DESC_UpdateAssistantsConfiguration_CleanExpressions
source: All files matching one of those patterns will be deleted from file storage on application starts
es: Todos los archivos que coincidan con uno de estos patrones se eliminarán del almacenamiento de archivos al iniciarse la aplicación.

# MSG_CleaningDocuments
source: Cleaning old working documents...
es: Limpiando documentos de trabajo anteriores...

# LAB_AllTogether
source: All Together
es: A la vez

# MSG_CurrentMove
source: {0} has moved {1}.
es: {0} ha movido {1}.

# MSG_NextMove
source: The next move in this match is: {0} moves {1}
es: El siguiente movimiento de la partida es: {0} mueven {1}

# MSG_NoMoreMoves
source: There are no more moves
es: No hay más movimientos

# NAME_APIPlayerData_ReasoningLevel
source: Reasoning Level
es: Nivel de razonamiento

# DESC_APIPlayerData_ReasoningLevel
source: Set the level of reasoning for the model. Set up only for reasoning models.
es: Establece el nivel de razonamiento del modelo. Solo para modelos que admiten razonamiento.

# LAB_BADMOVE13
source: No such piece to move
es: No existe la pieza a mover

# LAB_BADMOVE14
source: There are other pieces that obstruct the move
es: Otras piezas obstruyen el movimiento
