Repository: mdkusz/AIChessDB
Catalog: Resources/Properties/UIResources.*.resx
Languages: es

# NAME_FormatValueType
source: Matching Value generic data type
es: Tipo de datos genérico de valor coincidente

# NAME_FormFOManagerType
source: Filter Manager Type
es: Tipo de gestor de filtrado

# NAME_FormIcon
source: Form Icon
es: Icono del formulario

# NAME_FormQuery
source: Form Query
es: Consulta del formulario

# NAME_FormQueryConnection
source: Query Connection
es: Conexión de la consulta

# NAME_FormShowingType
source: Form Open Mode
es: Modo de apertura del formulario

# NAME_FormTitle
source: Form Title
es: Titulo del formulario

# NAME_FormType
source: Form Type
es: Tipo del formulario

# NAME_FriendlyDescription
source: Friendly Description
es: Description para mostrar al usuario

# NAME_FriendlyName
source: Friendly Name
es: Nombre para mostrar al usuario

# NAME_GenericDataImportManager
source: Generic Data Importation
es: Importación genérica de datos

# NAME_GenericQueryUpdateManager
source: Generic Data Updating
es: Actualización de datos genérica

# NAME_GridColumnType
source: Column Editor Type
es: Tipo de editor para la columna

# NAME_Having
source: Having clause
es: Cláiusula Having

# NAME_Hidden
source: Hidden
es: Oculto

# NAME_IgnoreCase
source: Ignore Case
es: No diferenciar mayúsculas y minúsculas

# NAME_ImpError
source: Import Error
es: Error de importación

# NAME_ImportBehaviour
source: Import Behaviour
es: Comportamiento al importar

# NAME_ImportColumns
source: Columns
es: Columnas

# NAME_ImportQuery
source: Import Query
es: Consulta de importación

# NAME_ImportStoredProc
source: Stored Procedure
es: Procedimiento almacenado

# NAME_ImportTarget
source: Target Selection
es: Selección de destino

# NAME_ImpOverload
source: Import Overload
es: Sobrecarga del procedimiento de importación

# NAME_ImpParameter
source: Import Parameters
es: Parámetros de importación

# NAME_ImpProcName
source: Import Procedure
es: Procedimient de importación

# NAME_IntConnString
source: Connection String
es: Cadena de conexión

# NAME_Interactive
source: Interactive
es: Interactivo

# NAME_InteractiveDataImportManager
source: Interactive Data Import Manager
es: Gestor de importación interactivo

# NAME_IsPassword
source: Password
es: Contraseña

# NAME_ItalicFormatter
source: Italic
es: Itálica

# NAME_ItalicFormatterByValue
source: Italic by value
es: Itálica según valor

# NAME_ItalicFormatterIf
source: Conditional italic
es: Itálica condicional

# NAME_Locked
source: Locked
es: Bloqueada

# NAME_Mandatory
source: Mandatory
es: Obligatorio

# NAME_ModalDialogBox
source: Modal Dialog Box
es: Cuadro de diálogo modal

# NAME_ModalTextCfg
source: Selection Dialog Box Configuration
es: Configuración de cuadro de diálogo de selección

# NAME_Modifiers
source: Modifiers
es: Modificadores

# NAME_NoSpecificCfg
source: No Specific Configuration
es: Configuración inespecífica

# NAME_NotNull
source: Not Null
es: No nulo

# NAME_NumberFormatter
source: Number format
es: Fromato de número

# NAME_NumberFormatterByValue
source: Number format by value
es: Formato de número según valor

# NAME_NumberFormatterIf
source: Conditional number format
es: Formato de número condicional

# NAME_ObjectDescription
source: Object Description
es: Descripción del objeto

# NAME_ObjectName
source: Object Name
es: Nombre del objeto

# NAME_Overload
source: Overload
es: Sobrecarga

# NAME_ParamDataType
source: Parameter Type
es: Tipo de parámetro

# NAME_ParamDataTypeAs
source: Set Datatype
es: Establecer tipo de datos

# NAME_ParamDefValue
source: Default Value
es: Valor por defecto

# NAME_ParamImportError
source: Import Error
es: Error de importación

# NAME_ParamLength
source: Length
es: Longitud

# NAME_ParamNativeType
source: Native Type
es: Tipo nativo

# NAME_ParamPrecision
source: Precision
es: Precisión

# NAME_ParamScale
source: Scale
es: Escala

# NAME_ParamValidationError
source: Validation Error
es: Error de validación

# NAME_ProcedureFDesc
source: Procedure Friendly Description
es: Descripción del procedimiento en la interfaz de usuario

# NAME_ProcedureFName
source: Procedure Friendly Name
es: Nombre del procedimiento en la interfaz de usuario

# NAME_ProcedureName
source: Procedure Name
es: Nombre del procedimiento

# NAME_ProcedureParameters
source: Parameters
es: Parámetros

# NAME_QColunID
source: Index
es: Índice

# NAME_QColunName
source: Name
es: Nombre

# NAME_Query
source: Query
es: Consulta

# NAME_QueryCommand
source: Query Command
es: Comando de consulta

# NAME_QueryDescription
source: Query Description
es: Descripción de consulta

# NAME_QueryLink
source: Query Link
es: Enlace de consulta

# NAME_QueryLinkDesc
source: Query Link Description
es: Descripción del enlace

# NAME_QueryLinkName
source: Query Link Name
es: Nombre del enlace

# NAME_QueryName
source: Query Name
es: Nombre de la consulta

# NAME_QueryVersion
source: Query Version
es: Versión de la consulta

# NAME_ReadOnly
source: Read Only
es: Solo lectura

# NAME_Result
source: Result
es: Resultado

# NAME_RowBackColorFormatterByValue
source: Conditional row background color by value
es: Color de fondo de fila según valor

# NAME_RowBackColorFormatterIf
source: Conditional row background color
es: Color de fondo de fila condicional

# NAME_RowForeColorFormatterByValue
source: Conditional row foreground color by value
es: Color de texto de fila dsegún valor

# NAME_RowForeColorFormatterIf
source: Conditional row foreground color
es: Color de texto de fila condicional

# NAME_SelectionChangedNotification
source: Selection Changed Notification Type
es: Tipo de notificaicón de cambio de selección

# NAME_Serializer
source: Serializer Type
es: Tipo de serializador

# NAME_Server
source: Server
es: Servidor

# NAME_SpecificColumnCfg
source: Specific Column Configuration
es: Configuración específica

# NAME_SQLQueryBuilder
source: ISO Query Builder
es: Constructor de consultas ISO

# NAME_StoredProcedure
source: Stored Procedure or Function
es: Procedimiento almacenado o función

# NAME_TableDML
source: Table DML
es: DML de tabla

# NAME_Tables
source: Table
es: Tabla

# NAME_TargetLink
source: Target Database Selection
es: Selección de base de datos destino

# NAME_TemplateName
source: Name
es: Nombre

# NAME_TextReadOnly
source: Read Only Text
es: Texto de solo lectura

# NAME_TranslateFormatter
source: Translate from resources
es: Traducir desde recurso

# NAME_ValError
source: Validation Error
es: Error de validación

# NAME_ValOverload
source: Validation Overload
es: Sobrecarga de validación

# NAME_ValParameter
source: Validation Parameters
es: Parametros de validación

# NAME_ValProcName
source: Validation Procedure
es: Procedimiento de validación

# NAME_ValueSource
source: Value Source
es: Origen de valores

# NAME_ValueSourceType
source: Default Value Source
es: Origen de valor por defecto

# NAME_ValuesQuery
source: Values Selector
es: Selector de valor

# OPER_And
source: And
es: y

# OPER_Asc
source: Ascending
es: Ascendente

# OPER_Between
source: between
es: entre

# OPER_Desc
source: Descending
es: Descendente

# OPER_EndsWith
source: ends with
es: termina en

# OPER_Equals
source: equal to
es: igual a

# OPER_Finite
source: is finite
es: es finito

# OPER_GreaterThan
source: greater than
es: mayor que

# OPER_GreaterThanOrEqual
source: greater than or equal to
es: mayor o gual que

# OPER_In
source: in
es: en

# OPER_Infinite
source: is infinite
es: es infinito

# OPER_Is
source: is
es: es

# OPER_IsNaN
source: is not a number
es: no es un número

# OPER_IsNot
source: is not
es: no es

# OPER_IsNotNaN
source: is a number
es: es un número

# OPER_IsNotNull
source: is not empty
es: no vacío

# OPER_IsNull
source: is empty
es: vacío

# OPER_LessThan
source: less than
es: menor que

# OPER_LessThanOrEqual
source: less than or equal to
es: menor o igual que

# OPER_Like
source: contains
es: contiene

# OPER_NotBetween
source: not between
es: no entre

# OPER_NotEndsWith
source: not ends with
es: no termina en

# OPER_NotEqual
source: different to
es: distinto a

# OPER_NotIn
source: not in
es: no en

# OPER_NotLike
source: not contains
es: no contiene

# OPER_NotRegexp
source: not matches
es: no cumple

# OPER_NotSounds
source: not sounds like
es: no suena como

# OPER_NotStartsWith
source: not starts with
es: en empieza con

# OPER_NullsFirst
source: Empty values first
es: Valores vacíos primero

# OPER_NullsLast
source: Empty values last
es: Valores vacíos al final

# OPER_Or
source: Or
es: o

# OPER_Regexp
source: matches
es: cumple

# OPER_Sounds
source: sounds like
es: suena como

# OPER_StartsWith
source: starts with
es: empieza con

# OP_GroupsUsers
source: Groups and Users
es: Grupos y usuarios

# OP_ObjectPermissions
source: Objects and Permissions
es: Objetos y permisos

# OP_ParamValues
source: Parameter and Values
es: Parámetros y valores

# OP_Connections
source: Connections
es: Conexiones

# ENUM_Comparison.Equal
source: Equal
es: Igual

# ENUM_Comparison.GreaterThan
source: Greater Than
es: Mayor

# ENUM_Comparison.GreaterThanOrEqual
source: Grater Than or Equal
es: Mayor o igual

# ENUM_Comparison.LessThan
source: Less Than
es: Menor

# ENUM_Comparison.LessThanOrEqual
source: Less Than or Equal
es: Menor o igual

# ENUM_Comparison.NotEqual
source: Different
es: Diferente

# ENUM_ValueType.DateTime
source: Date and Time
es: Fecha y hora

# ENUM_ValueType.Numeric
source: Number
es: Número

# ENUM_ValueType.String
source: Text
es: Texto

# PSOPER_NotRegexpLike
source: not matches
es: no cumple

# PSOPER_RegexpLike
source: matches
es: cumple

# OPER_BitAnd
source: bit and
es: and bits

# OPER_Not_Bitand
source: not bit and
es: no and bits

# OPER_BitXor
source: bit xor
es: o exclusivo bits

# OPER_NotBXor
source: not bit xor
es: no o exclusivo bit
