Repository: mdkusz/AIChessDB
Catalog: Resources/Properties/UIResources.*.resx
Languages: es

# DESCRIPTION_ParamNativeType
source: Parameter data type in the database
es: Tipo de datos del parámetro en la base de datos

# DESCRIPTION_ParamPrecision
source: Numeric precision
es: Precisión numérica (número de dígitos)

# DESCRIPTION_ParamScale
source: Numeric scale
es: Escala numérica (número de dígitos decimales)

# DESCRIPTION_ParamValidationError
source: Validation procedure parameter returning row validation error
es: Parámetro de retorno de error del procedimiento de validación de fila

# DESCRIPTION_ProcedureFDesc
source: Procedure description to show in the user interface to explain the procedure use
es: Descripción del procedimiento para mostrar en la interfaz de usuario cuando sea necesario explicar el uso del mismo

# DESCRIPTION_ProcedureFName
source: Procedure name to show in the user interface to refer to the procedure
es: Nombre del procedimiento que se mostrará en la interfaz de usuario para referirse al procedimiento

# DESCRIPTION_ProcedureName
source: Enter procedure qualified name
es: Escribir el nombre del procedimiento

# DESCRIPTION_ProcedureParameters
source: Procedure parameters list
es: Lista de parámetros del procedimiento

# DESCRIPTION_QColunID
source: Index base 1 of the column in the column list
es: Índice en base 1 de la columna en la lista de columnas

# DESCRIPTION_QColunName
source: Query column name
es: Nombre de la coluna de consulta

# DESCRIPTION_QueryDescription
source: Description of the query to store in the database
es: Descripción de la consulta a almacenar en la base de datos

# DESCRIPTION_QueryFileName
source: Provide a file name to read or write the query, or leave blank to show a dialog box to select it
es: Escriba un nombre de archivo para leer o guardar la consulta, o déjelo en blanco para seleccionarlo con un cuadro de diálogo

# DESCRIPTION_QueryLink
source: Current Query Link
es: Enlace de consulta actual

# DESCRIPTION_QueryLinkDesc
source: Query Link Friendly Description
es: Descripción del enlace de consulta en la interfaz de usuario

# DESCRIPTION_QueryLinkName
source: Query Link Friendly Name
es: Nombre del enlace de consulta en la interfaz de usuario

# DESCRIPTION_QueryName
source: Name of the query to store in the database
es: Nombre de la consulta a almacenar en la base de datos

# DESCRIPTION_QuerySerializer
source: Select a serializer to read and write the query from or to a file
es: Seleccionar un serializador para leer o escribir la consulta en un archivo o en la base de datos

# DESCRIPTION_QueryVersion
source: Query version number to have different configurations for the same query
es: Número de versión de la consulta, para poder tener diferentes configuraciones para la misma consulta

# DESCRIPTION_ReadOnly
source: Value cannot be changed
es: El valor no se puede cambiar

# DESCRIPTION_SelectionChangedNotification
source: Current command group selection changed notification type
es: Tipo de notificación de cambio de selección para el grupo de comandos actual

# DESCRIPTION_Server
source: Database server to parse and execute queries
es: Servidor de base de datos para compilar y ejecutar consultas

# DESCRIPTION_SpecificColumnCfg
source: Specific configuration according to the column editing style
es: Configuración específica en función del estilo de edición de la columna

# DESCRIPTION_TableDML
source: Select a table DML command to add to the current command group
es: Seleccione un comando DML de tabla para añadir al grupo de comandos actual

# DESCRIPTION_Tables
source: Select a table to create DML sentences
es: Seleccione una tabla para generar sentencias DML

# DESCRIPTION_TargetLink
source: Query link with the target database connection string selection query
es: Consulta de selección de cadena de conexión de enlace con la base de datos de destino

# DESCRIPTION_TemplateName
source: Name to identify this template
es: Nombre de la plantilla

# DESCRIPTION_TextReadOnly
source: Users can or cannot type text manually
es: Los usuarios pueden o no escribir texto manualmente

# DESCRIPTION_ValError
source: Validation error output parameter
es: Parametro de retorno del error de validación

# DESCRIPTION_ValOverload
source: Validation procedure overload
es: Identificador de sobrecarga del procedimiento de validación

# DESCRIPTION_ValParameter
source: Select a validation procedure parameter to configure it
es: Seleccione un parámetro del procedimiento de validación para configurar

# DESCRIPTION_ValProcName
source: Validation stored procedure name
es: Nombre del procedimiento almacenado de validación

# DESCRIPTION_ValueSource
source: Parameter value provider
es: Proveedor de valores para el parámetro

# DESCRIPTION_ValueSourceType
source: Parameter default value provider
es: Poveedor de valor por defecto para el parámetro

# DESCRIPTION_ValuesQuery
source: Select a query to provide all allowable values
es: Seleccione una consulta para proprocionar los valores admitidos

# DESCRIPTION_Visible
source: Visible in the user interface and query results.
es: Visible en la interfaz de usuario y los resultados de la consulta

# ENUM_ColumnMatch.All
source: Match Column Names, Data Types, Count and Positions
es: Coincidir nombres, tipo de datos, cuenta y posiciónes de columna

# ENUM_ColumnMatch.Count
source: Match Column Count
es: Coincidir cuenta de columnas

# ENUM_ColumnMatch.CountAndPositions
source: Match Column Count and Positions
es: Coincidir cuenta y posiciones de columnas

# ENUM_ColumnMatch.Names
source: Match Column Names
es: Coincidir nombres de columna

# ENUM_ColumnMatch.NamesAndCount
source: Match Column Names and Count
es: Coincidir nombres y cuenta de columnas

# ENUM_ColumnMatch.NamesAndPositions
source: Match Column Names and Positions
es: Coincidir nombres y posiciones de columna

# ENUM_ColumnMatch.NamesAndTypes
source: Match Column Names and Data Types
es: Coincidir nombres y tipos de dato de columna

# ENUM_ColumnMatch.NamesCountAndPositions
source: Match Column Names, Count and Positions
es: Coincidir nombres, cuenta y posiciónes de columna

# ENUM_ColumnMatch.NamesTypesAndCount
source: Match Column Names, Data Types and Count
es: Coincidir nombres, tipo de datos y cuenta de columnas

# ENUM_ColumnMatch.NamesTypesAndPositions
source: Match Column Names, Types and Positions
es: Coincidir nombres, tipo de datos y posiciónes de columna

# ENUM_ColumnMatch.None
source: No Match Needed
es: No requiere coincidencia

# ENUM_ColumnMatch.Positions
source: Match Column Positions
es: Coincidir posiciones de columna

# ENUM_ColumnMatch.Types
source: Match Column Data Types
es: Coincidir tipo de datos de columna

# ENUM_ColumnMatch.TypesAndCount
source: Match Column Data Types and Count
es: Coincidir posiciones y cuenta de columnas

# ENUM_ColumnMatch.TypesAndPositions
source: Match Column Data Types and Positions
es: Coincidir tipo de datos y posiciones de columna

# ENUM_ColumnMatch.TypesCountAndPositions
source: Match Column Data Types, Count and Positions
es: Coincidir posiciones, tipo de datos y cuenta de columnas

# ENUM_CommitHandling.AtEnding
source: Commit when all records are processed
es: Confirmar cuando se hayan procesado todos los registros

# ENUM_CommitHandling.ByBlock
source: Commit after a given number of records
es: Confirmar después de procesar un cierto número de registros

# ENUM_CommitHandling.None
source: Commit after each record is processed
es: Confirmar al procesar cada registro

# ENUM_DataRowStatus.Changed
source: Changed
es: Modificado

# ENUM_DataRowStatus.Error
source: Validation Error
es: Error de validación

# ENUM_DataRowStatus.NewRow
source: New Row
es: Nueva fila

# ENUM_DataRowStatus.Unchanged
source: No Changes
es: Sin cambios

# ENUM_DataRowStatus.Validated
source: Validated
es: Validada

# ENUM_DateFormat.Custom
source: Custom
es: A medida

# ENUM_DateFormat.Long
source: Long
es: Largo

# ENUM_DateFormat.Short
source: Short
es: Corto

# ENUM_ErrorHandling.RollbackAndContinue
source: Rollback and continue, report all errors at ending
es: Deshacer y continuar, informar de errores al terminar

# ENUM_ErrorHandling.RollbackReportAndContinue
source: Rollback, report error, and continue
es: Deshacer, informar del error y continuar

# ENUM_ErrorHandling.StopOnFirstError
source: Stop at the first error
es: Terminar al primer error

# ENUM_FormShowingMode.MDI
source: MDI Child Form
es: Formulario MDI hijo

# ENUM_FormShowingMode.Modal
source: Modal Form
es: Formulario modal

# ENUM_FormShowingMode.None
source: Not Configured
es: SIn configurar

# ENUM_FormShowingMode.NonModal
source: Non-Modal Form
es: Formulario no modal

# ENUM_GridColumnType.CheckBox
source: Check Box
es: Casilla para marcar

# ENUM_GridColumnType.ComboBox
source: Combo Box
es: Lista desplegable

# ENUM_GridColumnType.DateTime
source: Date and Time
es: Fecha y hora

# ENUM_GridColumnType.DetailComboBox
source: Detail Combo Box
es: Lista desplegable de detalle

# ENUM_GridColumnType.Image
source: Image
es: Imagen

# ENUM_GridColumnType.ModalText
source: Text With Modal Selector
es: Texto con selector modal

# ENUM_GridColumnType.None
source: None
es: Ninguno

# ENUM_GridColumnType.Text
source: Text
es: Texto

# ENUM_ImportBehaviour.AutoByRow
source: Commit After Row Validation
es: Confirmar después de validar

# ENUM_ImportBehaviour.ByUserCommand
source: User Action Commits the Validated Rows
es: Confirmar a petición del usuario

# ENUM_ImportBehaviour.None
source: None
es: Ninguno

# ENUM_ParameterDataType.DateTime
source: Date and Time
es: Fecha y hora

# ENUM_ParameterDataType.Number
source: Number
es: Número

# ENUM_ParameterDataType.Text
source: Text
es: Texto

# ENUM_QueryDataGridView.Mode.Filters
source: FIlters
es: Filtros

# ENUM_QueryDataGridView.Mode.Results
source: Results
es: Resultados

# ENUM_SelectionChangedNotification.Count
source: Record Count
es: Cuenta de filas

# ENUM_SelectionChangedNotification.CountAndData
source: Selected Records and Record Count
es: Datos seleccionados y cuenta de filas

# ENUM_SelectionChangedNotification.Data
source: Selected Records
es: Datos seleccionados

# ENUM_SelectionChangedNotification.None
source: None
es: Ninguno

# ENUM_SelectionType.Multiple
source: Any Number of Records
es: Cualquier número de filas

# ENUM_SelectionType.MultipleFixed
source: Fixed Number of Records
es: Número fijo de filas

# ENUM_SelectionType.MultipleLimited
source: Up to a Max Number of Records
es: Hasta un máximo número de filas

# ENUM_SelectionType.None
source: No Selection Needed
es: No requiere selección

# ENUM_SelectionType.Single
source: SIngle Record
es: Una sola fila

# ENUM_ValueSourceType.Application
source: Current Application
es: Aplicación actual

# ENUM_ValueSourceType.CommandQuery
source: Command Value-Selection Query
es: Consulta de selección de valores del comando

# ENUM_ValueSourceType.MasterQuery
source: Master Query
es: Consulta principal

# ENUM_ValueSourceType.None
source: No Source
es: Ninguno

# ENUM_ValueSourceType.OwnerObject
source: Owner Object
es: Objeto propietario

# ENUM_ValueSourceType.Query
source: Owner Query
es: Consula propietaria

# ENUM_ValueSourceType.User
source: User Input
es: Entrada del usuario

# ERROR_ColMandatory
source: The Value is Mandatory
es: El valor es obligatorio

# ERROR_ColNullValue
source: Empty values not allowed
es: Los valores vacíos no se admiten

# ERROR_DML
source: DML sentences not allowed in queries
es: No se admiten sentencias DML en las consultas

# ERROR_DuplicateUID
source: Duplicate UID: {0}
es: Identificador dupilcado: {0}

# ERROR_FunctionNotAllowed
source: Function not allowed here
es: Función no admitida aquí

# ERROR_InvalidArgument
source: Argument {0} is not valid
es: El argumento {0} no es válido

# ERROR_InvalidArgumentNumber
source: Invalid argument number
es: Número de argumentos incorrecto

# ERROR_InvalidDataType
source: Invalid data type
es: Tipo de datos incorrecto

# ERROR_InvalidDateTime
source: Invalid datetime format
es: Formato de fecha y hora incorrecto

# ERROR_InvalidFilterType
source: Invalid Filter Expression Type
es: Tipo de expresión de filtro incorrecto

# ERROR_MixedCategories
source: Element with different categories cannot be mixed
es: No se pueden mezclar elementos de diferentes categorías

# ERROR_NoDetailParameters
source: The secondary query must have some parameter to link
es: La consulta secundaria debe tener alún parámetro para enlazar

# ERROR_NonExpandable
source: Read only properties cannot be expandable
es: Las propiedades de dsolo lectura no pueden ser expandibles

# ERROR_NonLogicExpression
source: Not a logic expression
es: No es una expresión lógica

# ERROR_NumberNotValid
source: Invalid number
es: Número incorrecto

# ERROR_OBJECTNE
source: The {0} object doesn't exists
es: El objeto {0} no existe

# ERROR_QueryNotFound
source: Query not found in the database
es: No se ha encontrado la consulta en la base de datos

# ERROR_TypedElementRequired
source: Element with data type required to build a filter expression
es: Se requiere un elemento con tipo de datos para la expresión de filtro

# ERROR_TypeUndefinded
source: Column type not defined
es: No se ha definido el tipo de datos de la columna

# ERR_NotInTableColumn
source: The column {0} doesn't belong to the table {1}
es: La columna {0} no pertenece a la tabla {1}

# FILTER_XMLFiles
source: XML Files (*.xml)|*.xml|All Files (*.*)|*.*
es: Archivos XML (*.xml)|*.xml|Todos los archivos (*.*)|*.*

# FIL_ExcelFiles
source: Excel Files (*.xlsx)|*.xlsx|Excel 97-2003 Files (*.xls)|*.xls
es: Archivos Excel (*.xlsx)|*.xlsx|Archivos Excel 97-2003 (*.xls)|*.xls

# FNAME_avg
source: Average column value
es: Valor promedio de la columna

# FNAME_length
source: Column value text length
es: Longitud del texto de la columna

# FNAME_lower
source: Lowercase value
es: Valor en minúscula

# FNAME_max
source: Maximum column value
es: Valor máximo de la columna

# FNAME_min
source: Minimum column value
es: Valor mínimo de la columna

# FNAME_sum
source: Sum of column values
es: Suma de los valores de la columna

# FNAME_upper
source: Uppercase value
es: Valor en mayúscula

# LAB_And
source: and
es: y

# LAB_False
source: False
es: Falso

# LAB_IgnoreCase
source: Ignore Case
es: No diferenciar mayúsculas de minúsculas

# LAB_None
source: None
es: Ninguno

# LAB_Or
source: or
es: o

# LAB_True
source: True
es: Verdadero

# LAB_Unknown
source: Unknown
es: Desconocido

# MNU_ObjectDB
source: Object Database
es: Base de datos de objetos

# MNU_Parameters
source: Parameters
es: Parámetros

# MNU_Users
source: Users
es: Usuarios

# MSG_CreateAllUIItems
source: Create User Interface Items For All {0} Elements. Proceed?
es: Crear configuración de interfaz de usuario para {0} elementos. ¿Continuar?

# MSG_NumberTruncated
source: Number truncated
es: Número truncado

# MSG_ProcInGroup
source: The procedure or function is already in the command group
es: El procedimiento o fnción ya está en el grupo de comandos

# MSG_StringTruncated
source: String length truncated
es: Longitud de texto truncada

# NAME_ActiveLinks
source: Detail Query Links
es: Enlaces con consultas de detalle

# NAME_AppIcon
source: Application Icon
es: Icono de la aplicación

# NAME_AppPEStyle
source: Property Editors Style
es: Estilo de edición de propiedades

# NAME_AppTitle
source: Application Title
es: Título de la aplicación

# NAME_AppUID
source: Unique Identifier
es: Identificador único

# NAME_AppVersion
source: Application Version
es: Versión de la aplicación

# NAME_BackColorFormatter
source: Background color
es: Color de fondo

# NAME_BackColorFormatterByValue
source: Background color by value
es: Color de fondo según valor

# NAME_BackColorFormatterIf
source: Conditional background color
es: Color de fondo condicional

# NAME_BasicQueryConsole
source: Basic Query Commands Console
es: Consola de comandos de consulta básica

# NAME_BoldFormatter
source: Bold
es: Negrita

# NAME_BoldFormatterByValue
source: Bold by value
es: Negrita según valor

# NAME_BoldFormatterIf
source: Conditional bold
es: Negrita condicional

# NAME_Caption
source: Caption
es: Encabezado

# NAME_CellValColName
source: Modified Column Name Parameter
es: Parámetro de nombre de columna modificada

# NAME_CellValError
source: Cell Validation Error Parameter
es: Parámetro con el error de validación de celda

# NAME_CellValOverload
source: Cell Validation Overload
es: Sobrecarga de procedimiento de validación de celda

# NAME_CellValParameter
source: Cell Validation Parameters
es: Parámetros de validación de celda

# NAME_CellValProcName
source: Cell Validation Procedure
es: Procedimiento de validación de celda

# NAME_CfgConString
source: Configuration Connection String
es: Cadena de conexión de configuración

# NAME_CfgDatabaseManager
source: CONFIGURATION Schema
es: Esquema CONFIGURATION

# NAME_CheckMode
source: Check Mode
es: Modo de comprobación

# NAME_CmdCaption
source: Caption
es: Encabezado

# NAME_CmdCommitBlockSize
source: Commit Block Size
es: Tamaño del bloque de confirmación

# NAME_CmdCommitHandling
source: Commit Handling
es: Gestión de confirmación

# NAME_CmdDescription
source: Description
es: Descripción

# NAME_CmdErrorHandling
source: Error Handling
es: Gestión de errores

# NAME_CmdErrorMessage
source: Error Message
es: Mensaje de error

# NAME_CmdFormInfo
source: Command Form Type
es: Tipo de formulario de comando

# NAME_CmdGroup
source: Command Group
es: Grupo de comandos

# NAME_CmdGroupDesc
source: Command Group Description
es: Descripción del grupo de comandos

# NAME_CmdGroupIndex
source: Command Group Index
es: Índice del grupo de comandos

# NAME_CmdGroupName
source: Command Group Name
es: Nombre del grupo de comandos

# NAME_CmdIcoActive
source: Icon Active
es: Icono activo

# NAME_CmdIcoInactive
source: Icon Inactive
es: Icono inactivo

# NAME_CmdIndex
source: Command Index
es: Índice del comando

# NAME_CmdMainSelCount
source: Main Query Selection Count
es: Cuenta de selección en consulta principal

# NAME_CmdMainSelectionType
source: Main Query Selection Type
es: Tipo de selección en consulta principal

# NAME_CmdMergeAction
source: Merge Action
es: Acción de intercalado

# NAME_CmdMergeIndex
source: Merge Index
es: Índice de intercalado

# NAME_CmdPath
source: Command path
es: Ruta del comando

# NAME_CmdSelCount
source: Selection Count
es: Cuenta de seleccionados

# NAME_CmdSelectionType
source: Selection Type
es: Tipo de selección

# NAME_CmdSuccessMessage
source: Success Message
es: Mensaje de éxito

# NAME_CmdWarningMessage
source: Warning Message
es: Mensaje de aviso

# NAME_CodeBuilder
source: Procedure Manager
es: Gestor de procedimientos

# NAME_ColumnCfg
source: Column Configuration
es: Configuración de columna

# NAME_ColumnIndex
source: Index
es: Índice

# NAME_ColumnLink
source: Current Link
es: Enlace actual

# NAME_ColumnLinkKey
source: Key
es: Clave

# NAME_ColumnLinkKeyColumn
source: Column Name
es: Nombre de columna

# NAME_ColumnLinkMasterColumn
source: Parent Column
es: Columna padre

# NAME_ColumnLinkName
source: Key or Link Name
es: Nombre de clave o enlace

# NAME_ColumnMatch
source: Column Matching
es: Emparejamiento de columnas

# NAME_ColumnName
source: Name
es: Nombre

# NAME_ColumnSet
source: Column Set
es: Conjunto de columnas

# NAME_ColumnSetDesc
source: Column Set Description
es: Descripción de conjunto de columnas

# NAME_ColumnSetFilterCol
source: Filtering Column
es: Columna de filtrado

# NAME_ColumnSetName
source: Column Set Name
es: Nombre del conjutno de columnas

# NAME_ColumnSetNameCol
source: Naming Column
es: Columna de nombre

# NAME_ColumnType
source: Data Type
es: Tipo de datos

# NAME_Command
source: Command
es: Comando

# NAME_CommandList
source: Command list container
es: Contenedor de listas de comandos

# NAME_CommandSeparator
source: Command Separator
es: Separador de comandos

# NAME_Condition
source: Conditional Expresion
es: Expresión condicional

# NAME_Connector
source: Connection
es: Conexión

# NAME_ConString
source: Connection String
es: Cadena de conexión

# NAME_CSSFormatter
source: CSS class
es: Clase CSS

# NAME_CSSFormatterByValue
source: CSS class by value
es: Clase CSS según valor

# NAME_CSSFormatterIf
source: Conditional CSS class
es: Clase CSS condicional

# NAME_CustomFormat
source: Custom Format String
es: Cadena de formato personalizado

# NAME_DatabaseFormatter
source: Export to Database
es: Exportar a base de datos

# NAME_DataExportCmdGroup
source: Data Export Command Group
es: Grupo de comandos de exportación de datos

# NAME_DateAndTimeCfg
source: Date Configuration
es: Configuración de fecha

# NAME_DateFormatter
source: Date and time format
es: Formato de fecha y hora

# NAME_DateFormatterByValue
source: Date and time format by value
es: Formato de fecha y hora por valor

# NAME_DateFormatterIf
source: Conditional date and time format
es: Formato de fecha y hora condicional

# NAME_DateStyle
source: Date Style
es: Estilo de fecha

# NAME_DBProviderList
source: Database Providers List
es: Lista de proveedores de base de datos

# NAME_DelError
source: Delete Row Error
es: Error de borrado de fila

# NAME_DelOverload
source: Delete Procedure Overload
es: Sobrecarga de procedimiento de borrado

# NAME_DelParameter
source: Deletion Parameters
es: Parámetros de borrado

# NAME_DelProcName
source: Delete Procedure
es: Procedimiento de borrado

# NAME_Description
source: Description
es: Descripción

# NAME_DesktopControls.Forms.BasicImportForm
source: Import Data Form
es: Formulario de importación de datos

# NAME_DesktopControls.Forms.MasterDetailForm
source: Master-Detail Form
es: Formulario maestro-detalle

# NAME_DesktopControls.Forms.MasterDetailHGForm
source: Master-Detail Hierarchical Form
es: Formulario jerárquico maestro-detalle

# NAME_DesktopControls.Forms.MasterMultiDetailForm
source: Master-Multiple Detail Form
es: Formulario maestro-múltiple detale

# NAME_DesktopControls.Forms.SelectionDialogBox
source: Value Selection Dialog Box
es: Cuadro de diálogo de selección de valores

# NAME_DesktopControls.Forms.SingleGridEditForm
source: Single Data Editing Grid Form
es: Formulario para edición manual de datos

# NAME_DesktopControls.Forms.SingleQueryForm
source: Single Query Form
es: Formulario de consulta simple

# NAME_DetailDBProvider
source: Linked Query DB Provider
es: Proveedor de conexión

# NAME_DetailQuery
source: Linked Query
es: Consulta enlazada

# NAME_DMLCmdFDesc
source: DML Command Friendly Description
es: Descripción del comando DML para mostrar al usuario

# NAME_DMLCmdFName
source: DML Command Friendly Name
es: Nombre del comando DML para mostrar al usuario

# NAME_DMLCmdParameters
source: DML Command Parameters
es: Parámetros del comando DML

# NAME_DMLCommands
source: Command
es: Comando

# NAME_DMLParameter
source: Command Parameter
es: Parámetros del comando

# NAME_EditMask
source: Editor Mask
es: Máscara de edición

# NAME_EditorSubtypeSource
source: Editor Subtype Source
es: Origen de subtipos de editor

# NAME_EditorValueProvider
source: Editor Value Provider
es: Proveedor de valores del editor

# NAME_EditPosition
source: Edit Position
es: Posición de edición

# NAME_ExcelFormatter
source: Export formatted data to Excel
es: Exportar datos formateados a Excel

# NAME_ExpConnString
source: Target Connection
es: Conexión de destino

# NAME_Export
source: Export
es: Exportar

# NAME_FileName
source: File Name
es: Nombre de archivo

# NAME_ForeColorFormatter
source: Foreground color
es: Color de primer plano

# NAME_ForeColorFormatterByValue
source: Foreground color by value
es: Color de primer plano según valor

# NAME_ForeColorFormatterIf
source: Conditional foreground color
es: Color de primer plano condicional

# NAME_FormatString
source: Format String
es: Cadena de formato

# NAME_FormatValue
source: Matching Value
es: Valor coincidente
