Repository: mdkusz/AIChessDB
Catalog: Resources/Properties/UIResources.*.resx
Languages: es

# CAP_Confirm
source: Confirmation
es: Confirmación

# CAP_XMLObjDesc
source: Description
es: Descripción

# CAP_XMLObjName
source: Name
es: Nombre

# CAP_XMLObjProv
source: Provider
es: Proveedor

# CAP_XMLObjSer
source: Serializer
es: Serializador

# CAP_XMLObjType
source: Type
es: Tipo

# CAP_XMLObjVer
source: Version
es: Versión

# CATEGORY_AppInfo
source: Application
es: Applicación

# CATEGORY_CmdForm
source: Command Form Configuration
es: Configuración de formulario

# CATEGORY_CmdInfo
source: Command UI Configuration
es: Configuración de interfaz de usuario

# CATEGORY_ColSpecific
source: Specific Configuration
es: Configuración específica

# CATEGORY_ColumnInfo
source: Query Column
es: Columna de consulta

# CATEGORY_ColumnLink
source: Column Link
es: Enlace entre columnas

# CATEGORY_ColumnSet
source: Column Set
es: Conjunto de columnas

# CATEGORY_Database
source: Database
es: Base de datos

# CATEGORY_Databases
source: Databases
es: Bases de datos

# CATEGORY_DataImport
source: Data Import
es: Importación de datos

# CATEGORY_DBConnectors
source: Database Connector
es: Conector con base de datos

# CATEGORY_DMLCommand
source: DML Command
es: Comando DML

# CATEGORY_DMLQuery
source: Query Command Groups
es: Grupos de comandos de consulta

# CATEGORY_DMLTable
source: Table DML
es: DML de tabla

# CATEGORY_ElementProvider
source: Object Factory
es: Factoría de objetos

# CATEGORY_ExportTemplate
source: Export Template
es: Plantilla de exportación

# CATEGORY_Filter
source: Filter
es: Filtro

# CATEGORY_Formatter
source: Formatter
es: Formateador

# CATEGORY_FormInfo
source: Command Form Configuration
es: Configuración de formulario

# CATEGORY_Having
source: Filters by Aggregate
es: Filtros por agregados

# CATEGORY_ImportColumn
source: Column Configuration
es: Configuración de columna

# CATEGORY_ObjectSerializer
source: Object Serializer
es: Serializador del objeto

# CATEGORY_Order
source: Order
es: Orden

# CATEGORY_Parameters
source: Parameters
es: Parámetros

# CATEGORY_Programmability
source: Programmability
es: Procedimientos

# CATEGORY_QueryCmd
source: Query Commands
es: Comandos de consulta

# CATEGORY_QueryLink
source: Query Link
es: Enlace entre consultas

# CATEGORY_QueryParser
source: Query Parser
es: Parser de consulta

# CATEGORY_QuerySerializer
source: Query Serializer
es: Serializador de consulta

# CATEGORY_QueryValueListProvider
source: Value list from query
es: Lista de valores desde consulta

# CATEGORY_StoredProc
source: Stored Procedure
es: Procedimiento almacenado

# CATEGORY_UserInterface
source: User Interface
es: Interfaz de usuario

# CATEGORY_Value
source: Value
es: Valor

# CATEGORY_ValueType
source: Data Type
es: Tipo de datos

# CATEGORY_Where
source: Filters by Column
es: Filtros por columna

# DESCRIPTION_ActiveLinks
source: Detail query links used in the current form
es: Enlaces con consultas de detalle usados en el formulario actual

# DESCRIPTION_AppIcon
source: Application icon resource name
es: Nombre del recurso de icono de la aplicación

# DESCRIPTION_AppPEStyle
source: Set property editors default style
es: Establecer el estilo por defecto de edición de propiedades

# DESCRIPTION_AppTitle
source: Application main form title. It can be a string resource name
es: Título del formulario principal de la aplicación. Puede ser un nombre de recurso.

# DESCRIPTION_AppUID
source: Application unique identifier
es: Identificador úncio de la aplicación

# DESCRIPTION_AppVersion
source: Application version number to have different configurations for the same application
es: Número de versión de la aplicación. Permite almacenar diferentes configuraciones para la misma aplicación.

# DESCRIPTION_Caption
source: Column caption
es: Encabezado de columna

# DESCRIPTION_CellValColName
source: Identifier of the parameter used to pass the changed column name to the cell validation procedure
es: Identificador del parámetro que pas el nombre de la columna modificada al procedimiento de validación de celda

# DESCRIPTION_CellValError
source: Name of the parameter that returns the error message after validating a cell change
es: Nombre del parámetro que devuelve un mensaje de error después de validar un cambio en una celda

# DESCRIPTION_CellValOverload
source: Cell validation stored procdure overload identifier
es: Identificador de sobrecarga de procedimiento de validación de celda

# DESCRIPTION_CellValParameter
source: Select a cell validation procedure parameter to configure it
es: Seleccione un parámetro del procedimiento de validación de celda para configurarlo

# DESCRIPTION_CellValProcName
source: Cell validation stored procedure name to process each cell change
es: Nombre del procedimiento almacenado de validación de celda

# DESCRIPTION_CfgConString
source: Connection string for the configuration schema
es: Cadena de conexión con el esquema de configuración

# DESCRIPTION_CfgDatabaseManager
source: Database manager specialized in the CONFIGURATION schema
es: Gestor de base de datos especializado en el esquema CONFIGURATION

# DESCRIPTION_CheckMode
source: Select an opperation to check the row value
es: Seleccionar una operación para comprobar el valor de la fila

# DESCRIPTION_CmdCaption
source: Text to show in the controls that fire this command
es: Texto para mostrar en los controles que ejecutan el comando

# DESCRIPTION_CmdCommitBlockSize
source: Specify the number of records processed after commit work, 0 or less to commit at each record
es: Especificar el númeor de registros a procesar antes de confirmar, 0 o menos para confirmar cada registro individual

# DESCRIPTION_CmdCommitHandling
source: Specify the application behavior to commit work
es: Especificar el comportamiento de la aplicación para confirmar el trabajo

# DESCRIPTION_CmdDescription
source: Command description to show in the user interface
es: Descripción del comando para mostrar en la interfaz de usuario

# DESCRIPTION_CmdErrorHandling
source: Specify the application behavior on command error
es: Especificar el comprotamiento de la aplicación ante un error del comando

# DESCRIPTION_CmdErrorMessage
source: Mesage to show to the user when an error is thrown
es: Mensaje a mostrar cuando se produce un error

# DESCRIPTION_CmdFormInfo
source: Select an available form type if needed
es: Seleccione uno de los tipos de formulario si es necesario

# DESCRIPTION_CmdGroup
source: Current query command group to configure
es: Grupo de comandos actual a configurar

# DESCRIPTION_CmdGroupDesc
source: Current query command group friendly description
es: Descripción del grupo de comandos de consulta actual para mostrar al usuario

# DESCRIPTION_CmdGroupIndex
source: Current query command group order index
es: Índice de orden del grupo de comandos de consulta actual

# DESCRIPTION_CmdGroupName
source: Current query command group friendly name
es: Nombre del grupo de comandos de consulta actual para mostrar al usuario

# DESCRIPTION_CmdIcoActive
source: Identifier of the active command image resource (Resource name, css class , etc.)
es: Identificador del recurso de imagen activa del comando (Nombre de recurso, clase css, etc.)

# DESCRIPTION_CmdIcoInactive
source: Identifier of the inactive command image resource (Resource name, css class , etc.)
es: Identificador del recurso de imagen inactiva del comando (Nombre de recurso, clase css, etc.)

# DESCRIPTION_CmdIndex
source: Index to order commands in the group
es: Índice para ordenar los comandos en el grupo

# DESCRIPTION_CmdMainSelCount
source: Multiple selection records count in the main query. Fixed Number of Records = mandatory count, Up to a Max Number of Records = max count, Others = value ignored
es: Cuenta de selección múltiple de registros en la consulta principal. Número fijo de registros = cuenta obligatoria, Hasta un determinado número = cuenta máxima, Otros = se ignora el valor

# DESCRIPTION_CmdMainSelectionType
source: Main query data selection type needed to use this command
es: Tipo de selección de registros en la consulta principal necesaria para activar el comando

# DESCRIPTION_CmdMergeAction
source: Mode to merge with other commands
es: Modo de intercalación con otros comandos

# DESCRIPTION_CmdMergeIndex
source: Index to merge with other commands
es: Índice de intercalación con otros comandos

# DESCRIPTION_CmdPath
source: Whole command path up to the structure root
es: Ruta completa del comando hasta la ráiz

# DESCRIPTION_CmdSelCount
source: Multiple selection records count. Fixed Number of Records = mandatory count, Up to a Max Number of Records = max count, Others = value ignored
es: Cuenta de selección múltiple de registros en la consulta. Número fijo de registros = cuenta obligatoria, Hasta un determinado número = cuenta máxima, Otros = se ignora el valor

# DESCRIPTION_CmdSelectionType
source: Data selection type needed to use this command
es: Tipo de selección de registros necesaria para activar el comando

# DESCRIPTION_CmdSuccessMessage
source: Message to show to the user when the command execution has successfully finished
es: Mensaje a mostrar al usuario conado el comando ha terminado con éxito

# DESCRIPTION_CmdWarningMessage
source: Message to show to the user before executing the command to allow them to cancel the operation
es: Mensaje a mostrar al usuario antes de ejecutar el comando para permitirle cancelar la operación

# DESCRIPTION_CodeBuilder
source: Select a procedure manager to perform procedure calls
es: Seleccioanr un gestor de procedimientos almacenados

# DESCRIPTION_ColumnCfg
source: Column configuration in user interface
es: Configuración de la columna en la interfaz de usuario

# DESCRIPTION_ColumnDescription
source: Column content description
es: Descripción del contenido de la columna

# DESCRIPTION_ColumnIndex
source: Column index in the data set row
es: Índice de la columna en la fila de datos

# DESCRIPTION_ColumnLink
source: Current defintion of key column or link between columns
es: Definición actual de columna clave o enlace entre columnas

# DESCRIPTION_ColumnLinkKey
source: This element is a key or a link
es: Este elemento es una clave o un enlace

# DESCRIPTION_ColumnLinkKeyColumn
source: Key or linked column
es: Columna clave o de enlace

# DESCRIPTION_ColumnLinkMasterColumn
source: Parent key column
es: Columna clave del registro padre

# DESCRIPTION_ColumnLinkName
source: Identifier of the key or column link
es: Identificador del enlace entre columnas

# DESCRIPTION_ColumnMatch
source: Data source columns matching type
es: Tipo de emparejamiento de columnas en la fuente de datos

# DESCRIPTION_ColumnName
source: Column name or caption
es: Nombre o encabezado de columna

# DESCRIPTION_ColumnSet
source: Column set that defines a column group as a separated hierarchy object
es: Conjunto de columnas que define un objeto como un nuevo elemento de jaerarquía

# DESCRIPTION_ColumnSetDesc
source: Column set friendly description
es: Descripción de conjunto de columnas para mostrar al usuario

# DESCRIPTION_ColumnSetFilterCol
source: Identifier of the column used to filter this object in user controls
es: Identifiador de la columna usada para filtrar este objeto

# DESCRIPTION_ColumnSetName
source: Column set friendly name
es: Nombre del conjunto de columnas para mostrar al usuario

# DESCRIPTION_ColumnSetNameCol
source: Identifier of the column used to get the object name in user controls
es: Identifiador de la consulta poara obtener el nombre del objeto en la interfaz de usuario

# DESCRIPTION_ColumnType
source: Column data type
es: Tipo de datos de la columna

# DESCRIPTION_ColumnVisible
source: The column is initially visible in the user interface. Users can show or hide it
es: La columna es visible inicialmente en la interfaz de usuario. Los usuarios pueden ocultarla y mostrarla

# DESCRIPTION_Command
source: Current query command
es: Comando de consulta actual

# DESCRIPTION_Condition
source: Write an expression. Use only standard logic and arithmetic operators, literal values or column names. Functions are not allowed
es: Escriba una expresión. Solo se admiten operadores lógicos y aritméticos estándar, valores literales o nombres de columna. Las funciones no están permitidas

# DESCRIPTION_ConString
source: Connection string for the database server
es: Cadena de conexión con la base de datos

# DESCRIPTION_CustomFormat
source: Set a suitable format string to custom format dates
es: Establezca una cadena de formato de fecha adecuada

# DESCRIPTION_DateStyle
source: Set the date style to use in the date column editors
es: Establecer el estilo de fecha en el editor

# DESCRIPTION_DBConnectors
source: Select the proper connector to the selected database
es: Seleccione el conector adecuado para la base de datos

# DESCRIPTION_DBProviderList
source: List of all available database service providers
es: Lista de proveedores de base de datos disponibles

# DESCRIPTION_DelError
source: Delete procedure error output parameter
es: Parametro de salida de error del procedimiento almacenado de borrado

# DESCRIPTION_DelOverload
source: Delete procedure overload identifier
es: Identificador de sobrecarga del procedimiento almacenado de borrado

# DESCRIPTION_DelParameter
source: Row deletion procedure parameters
es: Parámetros del procedimiento almacenado de borrado

# DESCRIPTION_DelProcName
source: Row deletion stored procedure name
es: Nombre del procedimiento almacenado de borrado

# DESCRIPTION_DesktopControls.Forms.BasicImportForm
source: Basic form to import data with source and target selection
es: Formulario básico de importación de datos con selección de origen y destino

# DESCRIPTION_DesktopControls.Forms.MasterDetailForm
source: Form with two grids for master-detail linked queries, with optional command panels and property editors
es: Formulario con dos tablas para consultas maestro-detalle, con paneles de comando y editores de propiedades opcionales

# DESCRIPTION_DesktopControls.Forms.MasterDetailHGForm
source: Form with a grid and a tree for hierarchical master-detail queries, with optional command panel and property editor
es: Formulario con una tablas y un árbol para consultas maestro-detalle jerárquicas, con paneles de comando y editores de propiedades opcionales

# DESCRIPTION_DesktopControls.Forms.MasterMultiDetailForm
source: Form with a master grid and multiple linked detail queries in a tab control, with optional command panels and property editors
es: Formulario con una tabla principal y múltiples secundarias para consultas maestro-detalle con varias consultas de detalle, con paneles de comando y editores de propiedades opcionales

# DESCRIPTION_DesktopControls.Forms.SingleQueryForm
source: Form with a single grid with optional command panel and property editor
es: Formulario con una tabla para consulta simple, con paneles de comando y editor de propiedades opcionales

# DESCRIPTION_DetailDBProvider
source: Linked query database provider
es: Proveedor de base de datos de la consulta enlazada

# DESCRIPTION_DetailQuery
source: Linked query name
es: Nombre de la consulta enlazada

# DESCRIPTION_DMLCmdFDesc
source: DML command description to show in the user interface
es: Desctipción del comando DML para motrar en la interfaz de usuario

# DESCRIPTION_DMLCmdFName
source: DML command name to show in the user inetrface
es: Nombre del comando DML para motrar en la interfaz de usuario

# DESCRIPTION_DMLCmdParameters
source: DML Command parameter list
es: Lista de parámetros del comando DML

# DESCRIPTION_DMLCommands
source: Current DML command
es: Comando DML actual

# DESCRIPTION_DMLParameter
source: Select a parameter from the selected command to configure it
es: Seleccioanr un parámetro del comando seleccionado para configurarlo

# DESCRIPTION_EditMask
source: Mask to format the parameter value in user interface editors
es: Máscara para formatear el valor en el editor del parámetro

# DESCRIPTION_EditorSubtypeSource
source: Element that provides an editor subtype value to configure the parameter editor
es: Elemento que proporciona un subtipo de editor para configurar el editor del parámetro

# DESCRIPTION_EditorValueProvider
source: Query that provides a list of fixed values to select in the parameter editor
es: Objeto que proporciona una lista de valores fijos al editor del parámetro

# DESCRIPTION_EditPosition
source: Tab position of the parameter value editor
es: Posición de tabulación del editor del parámetro

# DESCRIPTION_ExpConnString
source: Target database connection string name
es: Nombre de la cadena de conexión con la base de datos de destino

# DESCRIPTION_Export
source: Data in this column is included in the export data set
es: Esta columna se incluye al exportar los resultados de la consulta

# DESCRIPTION_FormatString
source: Write a format string suitable for the formatter type. Use .NET format strings for numbers and dates, and integer or hexadecimal numbers for colors
es: Esciba una cadena de formato apropiada para el tipo de formateador. Use cadens de formato .NET para números y fechas, y enteros o números hexadecimales para colores

# DESCRIPTION_FormatValue
source: Value to match as string
es: Valor (en formato de texto) a comprobar para aplicar el formato

# DESCRIPTION_FormatValueType
source: Value to match type
es: Tipo del valor a comprobar

# DESCRIPTION_FormFOManagerType
source: Select a filter and order editor type to use with the form query
es: Seleccione un tipo de editor de filtros y orden para el formulario de la consulta

# DESCRIPTION_FormIcon
source: Name of the resource containing the form icon
es: Nombre del recurso que contiene el icono del formulario

# DESCRIPTION_FormQuery
source: Query managed by the form
es: Consulta gestionada por el formulario

# DESCRIPTION_FormQueryConnection
source: Name of the query connection string
es: Nombre de la cadena de conexión de la consulta

# DESCRIPTION_FormShowingType
source: Select the window mode to open the form
es: Seleccionar el modo de apertura del formulario

# DESCRIPTION_FormTitle
source: Text to show in the form title bar
es: Texto para mostrar en la barra de título del formulario

# DESCRIPTION_FormType
source: The command shows this form when executed
es: Al ejecutar el comando se muestra este formulario

# DESCRIPTION_FriendlyDescription
source: Description of the element in the user interface
es: Descripción del elemento en la interfaz de usuario

# DESCRIPTION_FriendlyName
source: Name of the element in the user interface
es: Nombre del elemento en la interfaz de usuario

# DESCRIPTION_GenericDataImportManager
source: Generic data importation manager
es: Gestor de importación de datos genérico

# DESCRIPTION_GenericQueryUpdateManager
source: Generic query data update manager
es: Gestor de actualización de datos genérica

# DESCRIPTION_GridColumnType
source: Select an editor contol type to edit the data in this column
es: Seleccionar un tipo de control de edición para editar los datos de esta columna

# DESCRIPTION_Having
source: By default, filters are WHERE clause conditions. Change to true to use in the HAVING clause instead
es: Por defecto los filtros se aplican en la cláusula WHERE. Active este valor para usarlos en la cláusula HAVING

# DESCRIPTION_HiddenColumn
source: The column is always hidden in the user interface. User cannot make it visible
es: La columna siempre está oculta al usuario. El usuario no la puede hacer visible.

# DESCRIPTION_IgnoreCase
source: Compare the values ignoring character casing
es: Comparar los valores sin diferenciar mayúsculas y minúsculas

# DESCRIPTION_ImpError
source: Import error output parameter
es: Parametro de salida de error del procedimiento de importación

# DESCRIPTION_ImportBehaviour
source: Select when data changes will be committed to the target database
es: Seleccionar cuándo se confirman los datos modificados en la base de datos de destino

# DESCRIPTION_ImportColumns
source: Data import columns definition
es: Definición de columnas de datos de importación

# DESCRIPTION_ImportQuery
source: Query to get the data to import / export
es: Consulta para obtener los datos a exportar / importar

# DESCRIPTION_ImportStoredProc
source: Import or validation stored procedure configuration
es: Configuración del procedimiento de importación o validación

# DESCRIPTION_ImportTarget
source: Query to select a data import target
es: Consulta para seleccionar un destino de importación de datos

# DESCRIPTION_ImpOverload
source: Import data procedure overolad
es: Identificador de sobrecarga del procedimiento de importación de datos

# DESCRIPTION_ImpParameter
source: Select an import procedure parameter to configure
es: Seleccione un parámetro del procedimiento de importación de datos para configurar

# DESCRIPTION_ImpProcName
source: Import data stored procedure name
es: Nombre del procedimiento almacenado de importación de datos

# DESCRIPTION_IntConnString
source: Target database connection string name
es: Nombre de la cadena de conexión con la base de datos de destino

# DESCRIPTION_Interactive
source: Users can interact with the element, adding or modifying a filter or changing the order of the results
es: Los usuarios pueden interactuar con el elemento, añadiendo o modificando filtros o cambiando el orden de los resultados

# DESCRIPTION_InteractiveDataImportManager
source: Data import manager with user editing interaction
es: Gestor de improtación de datos con interacción del usuario

# DESCRIPTION_IsPassword
source: Mask the user input text in editors
es: Enmascarar el texto en los editores

# DESCRIPTION_Locked
source: Column is locked to horizontal scroll
es: La columna está bloqueada para el desplazamiento horizontal

# DESCRIPTION_Mandatory
source: The value is mandatory
es: El valor es obligatorio

# DESCRIPTION_ModalDialogBox
source: Use a modal or non-modal dialog box to select the data
es: Usar un cuadro de diálogo modal o no modal para seleccionar

# DESCRIPTION_Modifiers
source: Set how the results are sorted, such as in ascending or descending order or the position of empty values
es: Establecer cómo se ordenan los resultados, en orden ascendente o descendente, y la posición de los valores nulos

# DESCRIPTION_NotNull
source: The value cannot be null
es: El valor no puede ser nulo

# DESCRIPTION_ObjectDescription
source: Description of the object to store in the database
es: Descripción del objeto a almacenar en la base de datos

# DESCRIPTION_ObjectFileName
source: Provide a file name to read or write the object, or leave blank to show a dialog box to select it
es: Proporcione un nombre de archivo para abrir o guardar el objeto, o déjelo en blanco para seleccionarlo en el cuadro de diálogo

# DESCRIPTION_ObjectName
source: Name of the object to store in the database
es: Nombre del objeto a almacenar en la base de datos

# DESCRIPTION_ObjectSerializer
source: Select a serializer to read and write the object from or to a file
es: Seleccione un serializador para leer o escribir el objeto

# DESCRIPTION_Overload
source: Procedure version identifier
es: Identificador de versión del procedimiento

# DESCRIPTION_ParamDataType
source: Set the parameter datatype to edit the value properly
es: Establecer el tipo de datos del parámetro para editarlo adecuadamente

# DESCRIPTION_ParamDataTypeAs
source: Set parameter datatype as this query column
es: Establecer el tipo del parámetro como el de esta columna

# DESCRIPTION_ParamDefValue
source: Parameter default value to evaluate query results
es: Valor por defecto del parámetro

# DESCRIPTION_ParameterEditor
source: Parameter editor type
es: Tipo de editor del parámetro

# DESCRIPTION_ParamImportError
source: Import procedure parameter returning row import error
es: Parámetro de retorno de error del procedimiento de importación de fila

# DESCRIPTION_ParamLength
source: Max length in characters
es: Longitud máxima en caracteres
